{
  "## Plik. 1": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij przeznaczenie poszczególnych bitów rejestru STATUS.": "Rejestr STATUS jest rejestrem stanu używanym w wielu mikrokontrolerach i mikroprocesorach. Zawiera on wiele bitów, z których każdy pełni określoną rolę:\n\n- bit C: przeniesienie - ustawiany wtedy, gdy poprzednia operacja matematyczna spowodowała przeniesienie (ang. carry)\n- bit DC: połowa przeniesienia - ustawiany wtedy, gdy poprzednia operacja matematyczna spowodowała przeniesienie w połowie wartości (ang. half-carry)\n- bit Z: zero - ustawiany wtedy, gdy wynik poprzedniej operacji matematycznej jest równy 0\n- bit S: znak - ustawiany wtedy, gdy wynik poprzedniej operacji matematycznej jest ujemny\n- bit P/V: parzystość/przepełnienie - używany w niektórych architekturach procesorów do sygnalizowania błędu przepełnienia (ang. overflow)\n- bit N: ustawiany wtedy, gdy ostatnio wykonana operacja była odejmowaniem (ang. subtract)\n\nDzięki wykorzystaniu tych bitów, można np. w łatwy sposób sprawdzić, czy wynik ostatniej operacji matematycznej spełnia określone warunki, co może być przydatne w wielu sytuacjach."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "Tekstu na wyświetlaczu HD44780, a także jakie funkcje są dostępne dzięki temu oprogramowaniu.\n\nWyświetlacz HD44780 to popularny rodzaj wyświetlacza alfanumerycznego opieranego na technologii LCD. Do obsługi takiego wyświetlacza potrzebne jest oprogramowanie kontrolera, który stoi za działaniem tego urządzenia. W programowaniu tego typu wyświetlaczy stosowane są instrukcje sterujące umożliwiające kontrolę nad wyświetlanym tekstem, kursorami oraz innymi elementami interfejsu. \n\nPodstawowe instrukcje, które są niezbędne do wyświetlenia tekstu to między innymi:\n\n- Instrukcja ustawienia trybu 4-bitowego lub 8-bitowego komunikacji,\n- Instrukcja ustawienia liczby wierszy i kolumn wyświetlacza,\n- Instrukcja ustawienia trybu kursora,\n- Instrukcja włączenia i wyłączenia wyświetlacza,\n- Instrukcja ustawienia położenia kursora.\n\nDodatkowo, w oparciu o te instrukcje można zaimplementować szereg funkcji, takich jak:\n\n- Wpisywanie tekstu na wyświetlacz,\n- Przesuwanie tekstu w lewo lub w prawo,\n- Włączanie i wyłączanie migania kursora,\n- Zmienianie jasności wyświetlacza.\n\nProgramowanie wyświetlacza HD44780 to proces stosunkowo prosty, jednak wymaga dobrej znajomości instrukcji kontrolera, aby móc tworzyć zaawansowane funkcje i interfejsy. Dzięki właściwemu programowaniu możliwe jest uzyskanie wygodnego i przejrzystego interfejsu użytkownika w różnego rodzaju urządzeniach elektronicznych, takich jak zegarki, liczniki, kontrolery i wiele innych."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany jest czujnik opisany równaniem różniczkowym:\n\ndy/dt = a*y + b*x\n\ngdzie:\n- y(t) jest wynikiem pomiaru czujnika w chwili t\n- x(t) jest wartością sygnału wejściowego w chwili t\n- a, b są stałymi współczynnikami charakteryzującymi czujnik\n\nRównanie to opisuje dynamikę czujnika, czyli sposób w jaki reaguje on na zmiany sygnału wejściowego x(t). Im większe wartości a i b, tym bardziej czuły jest czujnik na zmiany sygnału wejściowego. Równanie to może być stosowane do modelowania różnych typów czujników, takich jak termometry, barometry czy akcelerometry."
      }
    ],
    "#n": 1
  },
  "## Plik. 2": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci programu w mikrokontrolerze PIC16f877A.": "Mikrokontroler PIC16f877A ma ograniczone możliwości adresacji pamięci w porównaniu do bardziej zaawansowanych mikrokontrolerów. Adresacja pamięci w tym mikrokontrolerze może odbywać się na kilka sposobów:\n\n1. Adresowanie bezpośrednie - Polega na bezpośrednim odwoływaniu się do adresu pamięci w instrukcji. Na przykład, instrukcja: \"MOVWF 0x20\" przeniesie wartość rejestru roboczego do adresu 0x20 w pamięci danych.\n\n2. Adresowanie za pomocą rejestru wskazującego - Wykorzystując rejestry wskaźnika (W), można odnieść się do jednego adresu pamięci z danymi lub instrukcji. Przykładowo, instrukcja \"MOVWF FSR\" przenosi wartość rejestru roboczego (W) do rejestru wskaźnika (FSR), który może służyć do adresowania pamięci.\n\n3. Adresowanie za pomocą rejestru i przesunięcia - Ten sposób adresacji pamięci umożliwia przesyłanie do pamięci adresu, który jest przesunięciem w ramach zawartości rejestru wskaźnika. Przykładowo, jeśli FSR ma wartość 0x10, to instrukcja \"MOVWF 0x0 (FSR)\" przeniesie wartość rejestru roboczego do adresu pamięci 0x10.\n\n4. Adresowanie za pomocą stałej i rejestru - Zastosowanie stałej (lub literału) i rejestru umożliwia dostęp do adresu pamięci, którego wartość jest wynikiem dodania wartości rejestru roboczego do podanej stałej. Przykładowo, instrukcja \"MOVLW 0x0A, ADDWF 0x20,W\" pobierze wartość 0x0A do rejestru roboczego, doda ją do zawartości adresu 0x20 w pamięci danych i wynik przenosi do rejestru roboczego.\n\n5. Adresowanie za pomocą indeksowania - Umożliwia to dostęp do pamięci poprzez przypisanie do adresu pamięci wartości liczbowej lub zawartości rejestru. Na przykład, instrukcja \"MOVF TBL, W, 0x1\" przeniesie wartość z tablicy pamięci o adresie TBL do rejestru roboczego (W) i inkrementuje adres TBL o 1."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy to urządzenie, które zamienia sygnał analogowy (np. dźwięk, obraz, temperaturę) na sygnał cyfrowy, przeznaczony do przetwarzania i interpretacji przez komputer. \n\nW procesie konwersji analogowo-cyfrowej najpierw sygnał jest próbkowany, co oznacza, że jest on pobierany przez konwerter w równych odstępach czasowych. Następnie, każda próbka jest kwantowana, co oznacza, że jej wartość jest zaokrąglana do najbliższej wartości na skali cyfrowej.\n\nWynikające z tego próbkowanie i kwantowanie mogą prowadzić do błędów, zwanych błędami kwantyzacji, które mogą wpłynąć na jakość sygnału. Aby zmniejszyć ryzyko tych błędów, konwertery wykorzystują różne techniki, takie jak oversampling, noise shaping i filtrowanie cyfrowe.\n\nAby korzystać z konwertera analogowo-cyfrowego, potrzebne są instrukcje, które pozwalają na ustawienie różnych parametrów konwersji, takich jak częstotliwość próbkowania i liczba bitów na próbkę. Należy także określić sposób, w jaki sygnał wejściowy jest podłączany do konwertera (np. za pomocą interfejsu USB, portu szeregowego lub złącza Ethernet).\n\nW niektórych przypadkach, szczególnie gdy chodzi o aplikacje specjalistyczne, może być konieczne dostosowanie konfiguracji konwertera analogowo-cyfrowego do indywidualnych potrzeb użytkownika. W takim przypadku potrzebne będzie programowanie w językach takich jak C, C++ lub Python."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany czujnik może być opisany równaniem różniczkowym, jeśli jego zachowanie jest opisane przez zmiany w czasie. Przykładowo, dany czujnik temperatury może być opisany równaniem różniczkowym związanym z prawem zmiany temperatury w czasie w danym punkcie. Równanie różniczkowe opisujące zachowanie czujnika może mieć różne postacie w zależności od rodzaju czujnika i jego specyfikacji. Ogólnie, równanie różniczkowe opisujące zachowanie czujnika może być wykorzystane do określenia jego dokładności, czułości i innych parametrów."
      }
    ],
    "#n": 2
  },
  "## Plik. 3": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci danych w mikrokontrolerze PIC16f877A.": "W mikrokontrolerze PIC16f877A, pamięć danych może być adresowana na kilka sposobów:\n\n1. Adresowanie bezpośrednie - adresowane są bezpośrednio rejestry, które przechowują dane. W tym przypadku, adres rejestru wskazuje na konkretny rejestr w pamięci danych.\n\n2. Adresowanie pośrednie - adresowane są rejestry wskaźnikowe, które wskazują na miejsce, gdzie przechowywane są dane. W tym przypadku, nie jest konieczne podanie bezpośredniego adresu pamięci, lecz wskaźnik wskazuje na nią.\n\n3. Adresowanie indeksowe - stosowane jest w przypadku dostępu do tablic lub struktur danych. Adres pamięci jest obliczany na podstawie wartości indeksu oraz offsetu.\n\n4. Adresowanie autoinkrementacyjne - pozwala na dynamiczne zmienianie adresu pamięci przy każdym odwołaniu do niego. W przypadku ustawienia bitu INDF Auto-Increment (INC), adres pamięci zostaje zwiększony o 1 po każdym odczycie lub zapisie.\n\n5. Adresowanie bezwzględne - adres pamięci jest podawany wprost, bezpośrednio w instrukcji. W tym przypadku, możliwe jest odwołanie się do dowolnego miejsca w pamięci danych."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "rezystancja źródła sygnału. Występuje tutaj także kondensator C1 o pojemności 100nF.\n\n Rysunek:\n                           |------Rs------+    \n                           |               |   \n                           |               C1    \n                       R1 _|_             \n                           |      \n                           |       \n                          ---              \n                           |      \n                          GND \n\nAby obliczyć impedancję układu, należy połączyć impedancje R1 oraz kondensatora C1, tworząc impedancję Z1:\n\nZ1 = 1 / (jωC1 + 1/R1)\n\ngdzie ω to pulsacja sygnału.\n\nNastępnie dodajemy rezystancję źródła sygnału Rs do impedancji Z1, otrzymując całkowitą impedancję układu:\n\nZ = Rs + Z1\n\nNa tej podstawie można wyznaczyć amplitudę i fazę sygnału na całkowitej impedancji Z."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany czujnik opisany jest równaniem różniczkowym, które opisuje jego zachowanie w czasie. Jest to równanie, które mówi, jak zmieniają się wartości mierzonej wielkości w zależności od czasu. Równanie to zazwyczaj jest zależne od wielu czynników, takich jak temperatura, wilgotność powietrza, ciśnienie atmosferyczne i inne, które mogą wpływać na wynik pomiaru. Często równanie to jest opisywane za pomocą równania różniczkowego pierwszego lub drugiego stopnia, które można rozwiązać numerycznie lub analitycznie, aby uzyskać wartości mierzonej wielkości w czasie.  Jednym z przykładów czujnika opisanego równaniem różniczkowym jest czujnik temperatury, którego działanie można opisać równaniem różniczkowym pierwszego stopnia."
      }
    ],
    "#n": 3
  },
  "## Plik. 4": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz elementy pamięci programu mikrokontrolera PIC16f877A.": "Mikrokontroler PIC16f877A ma następujące elementy pamięci:\n\n1. Pamięć programu (flash): jest to pamięć, w której znajdują się instrukcje programu. Może pomieścić do 14 336 słów (1 słowo = 14 bitów).\n\n2. Pamięć danych RAM: jest to pamięć, w której program przechowuje zmienne i bufory. Może pomieścić do 368 bajtów.\n\n3. Pamięć FIFO: jest to pamięć, która służy do przechowywania danych w trybie kolejki. Jest używana w łączności asynchronicznej i Synchronous Serial Port (SSP).\n\n4. Pamięć EEPROM: jest to pamięć, w której program może przechowywać dane trwałe. Może pomieścić do 256 bajtów.\n\n5. Pamięć rejestrowa: jest to zestaw specjalnych rejestrów w mikrokontrolerze, które przechowują stany flag, adresy, wartości i inne dane ważne dla działania programu.\n\n6. Pamięć stosu: jest to specjalna pamięć w mikrokontrolerze, która służy do przechowywania adresów powrotu i danych operacyjnych w trakcie wykonywania funkcji.\n\n7. Pamięć wektorów przerwań: jest to pamięć, w której przechowywane są adresy funkcji obsługujących przerwania."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwoma fazami aktywnymi.\n\nSilnik krokowy jest elektromechanicznym układem składającym się z jednej lub kilku faz, w których przepływa prąd zmieniający kierunek w określonych momentach, prowadząc do obracania się wału silnika. Sposób działania silnika krokowego zależy od trybu pracy, czyli liczby faz aktywnych.\n\nW trybie z pełnym krokiem i jedną fazą aktywną do silnika jest podawany impuls elektryczny, który włącza jedną fazę (np. fazę A) na zasadzie przemiany stanów logicznych. Po pewnym czasie impuls jest zatrzymywany (stan nieaktywny). W kolejnym kroku do silnika jest podawany kolejny impuls, który włącza fazę B, a następnie znowu następuje przerwa. Ten cykl jest kontynuowany, a każda faza odpowiada za obrót wału silnika o określoną wartość kąta.\n\nW trybie z pełnym krokiem i dwoma fazami aktywnymi do silnika jest podawany impuls elektryczny, który włącza dwie fazy jednocześnie (np. fazy A i B). Te dwie fazy utworzą pole magnetyczne, które przyciągnie do siebie kolejne zęby wału. Następnie impuls jest zatrzymywany, a na kolejnym kroku podawane są kolejne dwie fazy (np. fazy B i C), aż do obrócenia wału o odpowiednią liczbę kroków.\n\nW obu trybach pracy silnik krokowy wykonuje obrót o określoną wartość kąta, który zależy od liczby faz i kąta podzielonego na pełne kroki. Przy zwiększeniu liczby faz aktywnych następuje zwiększenie dokładności obrotu. Silnik krokowy jest często stosowany w urządzeniach precyzyjnych, takich jak roboty przemysłowe, drukarki, urządzenia medyczne, itp."
      },
      {
        "Zad. 3 Wyznacz (przybliżoną) liniową charakterystykę wejściowo-wyjściową czujnika, dla którego zebrano doświadczalnie": "nie następujące pomiary:\n\n| Wejście    | Wyjście   |\n|-----------|-----------|\n| 0         | 0         |\n| 10        | 2         |\n| 20        | 4         |\n| 30        | 6         |\n| 40        | 8         |\n\nAby wyznaczyć przybliżoną liniową charakterystykę wejściowo-wyjściową czujnika należy skorzystać z równania prostej y = kx + b, gdzie y jest wyjściem czujnika, x jest wejściem czujnika, k jest współczynnikiem kierunkowym, a b jest przesunięciem w pionie.\n\nNajpierw należy obliczyć wartość k:\n\nk = (y2 - y1) / (x2 - x1) = (2 - 0) / (10 - 0) = 0.2\n\nNastępnie można obliczyć wartość b, korzystając ze wzoru:\n\nb = y - kx\n\nŚrednia wartość wyjścia dla x = 0:\n\ny_avg = (y1 + y2) / 2 = (0 + 2) / 2 = 1\n\nb = y_avg - k * x_avg = 1 - 0.2 * 5 = 0\n\nOstatecznie, liniowa charakterystyka wejściowo-wyjściowa czujnika wynosi:\n\ny = 0.2x + 0\n\nJest to równanie prostej przechodzącej przez punkty (0,0) i (40,8), która reprezentuje przybliżoną liniową relację między wejściem i wyjściem czujnika."
      }
    ],
    "#n": 4
  },
  "## Plik. 5": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz podstawowe elementy pamięci mikrokontrolera PIC16f877A.": "1. Pamięć programu (FLASH) - to pamięć, w której przechowywany jest program zarządzający pracą mikrokontrolera. Zawiera ona instrukcje do wykonania przez procesor.\n\n2. Pamięć danych SRAM - to pamięć, w której przechowywane są zmienne oraz wyniki pośrednie obliczeń.\n\n3. Pamięć EEPROM - to pamięć nieulotna, w której przechowywane są dane, które nie powinny być tracone przy wyłączeniu zasilania.\n\n4. Przetwornik analogowo-cyfrowy (ADC) - to układ umożliwiający odczytanie sygnału analogowego i zamianę go na sygnał cyfrowy, który może być przetwarzany przez mikrokontroler.\n\n5. Moduł licznika/odbiornika czasu (Timer/Counter) - to układ umożliwiający pomiar czasu oraz generację sygnałów o określonym czasie trwania.\n\n6. Interfejsy komunikacyjne - mikrokontroler PIC16f877A posiada wiele interfejsów komunikacyjnych, takich jak UART, SPI czy I2C, umożliwiających komunikację z innymi urządzeniami.\n\n7. Wejścia/wyjścia (I/O) - mikrokontroler posiada wiele portów wejścia/wyjścia, które umożliwiają podłączenie różnych urządzeń zewnętrznych, takich jak przyciski, diody, czujniki, silniki itp.\n\n8. Procesor - to główny element mikrokontrolera, odpowiedzialny za przetwarzanie danych i wykonywanie instrukcji programu. W przypadku PIC16f877A jest to procesor RISC o taktowaniu do 20 MHz."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze p-n to połączenie dwóch warstw półprzewodników: p (z dodatnim nośnikiem ładunku) i n (z ujemnym nośnikiem ładunku) o przeciwnych ładunkach i różnych stężeniach domieszkujących. \n\nPodczas tworzenia złącze p-n dochodzi do dyfuzji nośników ładunku, czyli przeniku elektronów z obszaru n do p (dziury) oraz dziur do obszaru n (elektrony). Ten proces prowadzi do zmniejszenia stężenia nośników ładunku z obu stron złącza.\n\nKiedy złącze jest rożnicowane w kierunku przewodzenia \"przodem\" (P do N), to elektrodny przycisk zostaje zaktywowany blokując ruch dziur i elektronów z każdej strony złącza. Zmniejsza to potencjał dyfuzyjny i powoduje, że obszar złącza jest obszarem o wysokiej impedancji elektrostatycznej, a przycisk ten jest oznaczany jako przycisk barierowy. \n\nPrąd płynący przez złącze jest zwykle bardzo niewielki, a przepływ nośników zależy od różnicy potencjału między obszarami p i n, a także od barier potencjału. W złączu w kierunku odwrotnym przepływ nośników jest hamowany, a zwiększenie stosowanej siły elektromotorycznej powoduje przepływ prądu tylko pod warunkiem przekroczenia wartości napięcia zapłonowego. \n\nW związku z tym, zjawiska zachodzące w złączu pn, to dyfuzja nośników ładunku i przepływ prądu w zależności od kierunku napięcia zasilającego."
      }
    ],
    "#n": 5
  },
  "## Plik. 6": {
    "q&a": [
      {
        "Zad. 1 Opisz sposób działania stosu i instrukcje wykorzystywane do jego obsługi w mikrokontrolerach klasy PIC18fxx2 i": "Stos to struktura danych, w której elementy są dodawane lub usuwane tylko z jednego końca. W mikrokontrolerach klasy PIC18fxx2 stos jest implementowany w pamięci RAM i służy do przechowywania adresów powrotu do wywołującej funkcji, wartości rejestrów i zmiennych lokalnych.\n\nInstrukcje wykorzystywane do obsługi stosu to:\n\n- PUSH - dodaje wartość ze wskazanego rejestru na szczyt stosu.\n- POP - usuwa wartość ze szczytu stosu i zapisuje ją do wskazanego rejestru.\n- CALL - dodaje adres powrotu na stos i przechodzi do wskazanej funkcji.\n- RET - usuwa adres powrotu ze stosu i wraca do wywołującej funkcji.\n\nPrzykład użycia stosu w programie w języku assembler dla mikrokontrolera PIC18fxx2:\n\nORG 0x00\nSTART:\n    CALL FUNCTION\n    ; powrót z funkcji do START\n    RET\n\nFUNCTION:\n    ; dodanie wartości 0x05 na stos\n    MOVLW 0x05\n    PUSH WREG\n    ; dodanie wartości 0x0A na stos\n    MOVLW 0x0A\n    PUSH WREG\n    ; usunięcie wartości ze szczytu stosu i zapisanie jej do rejestru\n    POP REG1\n    ; usunięcie wartości ze szczytu stosu i zapisanie jej do rejestru\n    POP REG2\n    ; dodanie wartości z rejestru REG1 i REG2 i wynik zapisanie na stosie\n    ADDWF REG1, W\n    PUSH WREG\n    ; powrót do START\n    RET\n\nW powyższym przykładzie wartość 0x05 jest najpierw dodawana na stos za pomocą instrukcji PUSH, a następnie jest pobierana ze szczytu stosu za pomocą instrukcji POP i zapisywana do rejestru REG1. Podobnie, wartość 0x0A jest dodana na stos, pobrana ze szczytu stosu i zapisana do rejestru REG2. Następnie te dwie wartości są dodawane za pomocą instrukcji ADDWF i wynik jest zapisywany na stosie. Na koniec funkcja zwraca wartość i wraca do wywołującej funkcji za pomocą instrukcji RET."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość manipulatora SCARA.": "Ruchliwość manipulatora SCARA można obliczyć jako liczbę stopni swobody (DoF). Typowy manipulator SCARA ma 4 stopnie swobody, co oznacza, że ​​ma 4 niezależne ruchy lub kierunki, w których może poruszać narzędzie końcowe. Te 4 stopnie swobody odpowiadają ruchom:\n\n1. Przesunięcie w poziomie (ruch poziomy w płaszczyźnie roboczej)\n2. Przesunięcie w pionie (ruch pionowy w płaszczyźnie roboczej)\n3. Obrót wokół własnej osi w płaszczyźnie roboczej\n4. Obrót wokół osi pionowej mocowania podstawy (jeśli manipulator ma taką funkcjonalność)\n\nWarto jednak zaznaczyć, że w zależności od konstrukcji manipulatora, liczba stopni swobody może być różna."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie": "Zadanie kinematyki polega na wyznaczeniu położenia końcowego manipulatora w zależności od kąta obrotu łącza. Zatem, aby rozwiązać to zadanie, należy przeprowadzić kilka kroków:\n\n1. Zdefiniuj układ współrzędnych – w tym przypadku można przyjąć układ kartezjański, w którym początek układu znajduje się w punkcie podstawy manipulatora, a oś X ukierunkowana jest wzdłuż łącza obrotowego.\n\n2. Narysuj schemat manipulatora – w tym przypadku będzie to jedno łącze obrotowe, zamocowane na bazie.\n\n3. Wyznacz macierz przekształcenia – w celu wyznaczenia położenia końcowego manipulatora w zależności od kąta obrotu należy wyznaczyć macierz przekształcenia odwzorowującą ruch łącza obrotowego. Ponieważ mamy do czynienia z jednym łączem, a oś obrotu jest jednocześnie osią X układu współrzędnych, macierz przekształcenia przyjmuje postać:\n\nT = [cos θ -sin θ 0 0;\nsin θ cos θ 0 0;\n0 0 1 l 0;\n0 0 0 1 0]\n\ngdzie θ to kąt obrotu łącza, l to długość łącza, a 0 to wartość dla pozostałych współrzędnych.\n\n4. Wykonaj operacje na macierzy – aby uzyskać położenie końcowe manipulatora wystarczy pomnożyć macierz przekształcenia przez wektor położenia początkowego końca manipulatora (dla θ=0) i wykonać odpowiednie operacje na wynikowej macierzy. W końcowym wyniku, współrzędne x, y i z określają położenie końcowe manipulatora.\n\nPrzykładowo, jeśli długość łącza wynosi l=1, a kąt obrotu θ=45°, to po wykonaniu powyższych kroków, można otrzymać, że położenie końcowe manipulatora wynosi:\n\nx = 0.707; y = 0.707; z = 1.\n\nOznacza to, że końcowy punkt manipulatora znajduje się w odległości pierwiastka kwadratowego z 2 od początku układu współrzędnych w kierunku X i Y oraz na wysokości 1 od płaszczyzny X-Y."
      }
    ],
    "#n": 6
  },
  "## Plik. 7": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij znaczenie ﬂag konﬁguracji w mikrokontrolerze PIC16f877A": "Flagi konfiguracji w mikrokontrolerze PIC16f877A to specjalne bity, które umożliwiają ustawienie różnych trybów pracy mikrokontrolera. Flagi te kontrolują podstawowe funkcje takie jak włączanie i wyłączanie przerwań, tryby konwersji A/D, ustawianie prędkości zegara procesora, tryby programowania i wiele innych. Ustawienie odpowiednich flag konfiguracji jest ważnym etapem projektowania układów opartych na mikrokontrolerze, ponieważ ma to wpływ na wydajność i funkcjonalność całej aplikacji."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość (typowego) manipulatora ramieniowego.": "Ruchliwość manipulatora ramieniowego zależy od liczby stopni swobody. Standardowy manipulator ramieniowy ma 6 stopni swobody, co oznacza, że może się poruszać w 6 różnych kierunkach. Jest to najbardziej popularny typ manipulatora w przemyśle, ponieważ zapewnia dużą precyzję i elastyczność w wykonywaniu różnych zadań."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na": "wirniku silnika.\n\nNie zostało podane warunków początkowych, dlatego ciężko jest dokładnie rozwiązać to zadanie, ale przyjmując pewne założenia możemy przedstawić przykładowe rozwiązanie.\n\nZałóżmy, że manipulator zaczyna ruch w pozycji pionowej, a jego cel to obrócenie się wokół osi pionowej o kąt 45 stopni. Długość łącza pryzmatycznego wynosi 1 metr, a wirnik silnika obraca się z prędkością 1000 obr./min.\n\nW celu wykonania tego zadania musimy znać równania kinematyki manipulatora. Jednym z najważniejszych jest równanie przemieszczenia, które wyraża się wzorem:\n\ns = rΔφ\n\ngdzie:\n- s oznacza przemieszczenie (w metrach)\n- r to promień okręgu, po którym porusza się manipulator (w metrach)\n- Δφ to kąt obrotu (w radianach)\n\nZ tego wzoru wynika, że im większy promień okręgu, po którym porusza się manipulator, tym mniejszy musi być jego kąt obrotu, aby osiągnąć zadane przemieszczenie.\n\nW naszym przykładzie manipulator porusza się po okręgu o promieniu 1 metra, dlatego dla obrotu o 45 stopni (czyli Δφ = π/4 rad) przemieszczenie wyniesie:\n\ns = 1 * π/4 = 0,7854 metra\n\nKolejnym równaniem kinematycznym, które musimy znać, jest wzór na prędkość liniową, wyrażający prędkość, z jaką porusza się manipulator. W przypadku manipulatora z jednym łączem pryzmatycznym można to przedstawić w następujący sposób:\n\nv = rω\n\ngdzie:\n- v to prędkość liniowa (w metrach na sekundę)\n- r to promień okręgu, po którym porusza się manipulator (w metrach)\n- ω to prędkość kątowa (w radianach na sekundę)\n\nW naszym przypadku, zakładając prędkość kątową wirnika silnika na poziomie 1000 obr./min (czyli ω = 104,72 rad/s), prędkość liniowa wyniesie:\n\nv = 1 * 104,72 = 104,72 m/s\n\nJest to dość duża prędkość, dlatego przed rozpoczęciem ruchu bardzo ważne jest zadbanie o bezpieczeństwo pracy manipulatora oraz otoczenia, w którym się znajduje."
      }
    ],
    "#n": 7
  },
  "## Plik. 8": {
    "q&a": [
      {
        "Zad. 1 Czym jest histereza w układach wejściowo-wyjściowych.": "Histereza w układach wejściowo-wyjściowych to zjawisko, w którym wartość wyjściowa nie zależy tylko od wartości wejściowej w danym momencie, ale również od historii zmian wartości wejściowej. Innymi słowy, histereza występuje, gdy zmiana wartości wejściowej nie powoduje natychmiastowej i dokładnej zmiany wartości wyjściowej, ale na wpływają na nią zmiany wykonywane wcześniej. Jest to zjawisko powszechne w wielu układach mechanicznych, elektrycznych i sterujących. Przykładem histerezy może być sytuacja, w której dźwignia urządzenia pozostanie w pozycji otwartej, nawet gdy wartość wejściowa się zmieniła, a dopiero gdy ta wartość zostanie zmieniona o wiele większą ilość, dźwignia zacznie się poruszać."
      },
      {
        "Zad. 2 Wykonaj obrót punktu [1,1,1]o30◦dookoła wektora [0.5,0.4,0.3]. Zamieść odpowiednie obliczenia.": "Najpierw obliczamy długość wektora [0.5, 0.4, 0.3]:\n\nsqrt(0.5^2 + 0.4^2 + 0.3^2) ≈ 0.745\n\nNastępnie normalizujemy ten wektor, czyli dzielimy jego składowe przez jego długość:\n\n[0.5/0.745, 0.4/0.745, 0.3/0.745] ≈ [0.671, 0.536, 0.402]\n\nMamy teraz wektor jednostkowy, który posłuży nam jako oś obrotu.\n\nAby wykonać obrót punktu [1, 1, 1] o 30 stopni wokół tego wektora, możemy użyć wzoru:\n\np' = cos(θ) * p + sin(θ) * (k x p) + (1 - cos(θ)) * (k * p) * k\n\ngdzie:\n- p to punkt, który obracamy\n- p' to wynikowy punkt po obróceniu\n- θ to kąt obrotu (30 stopni w tym przypadku)\n- k to wektor jednostkowy, określający oś obrotu\n\nPierwszą operacją, jaką musimy wykonać, jest produkt wektorowy k x p. Możemy to zrobić następująco:\n\n[0.671, 0.536, 0.402] x [1, 1, 1] =\n[0.536 - 0.402, -0.402 + 0.402, 0.402 - 0.536] =\n[0.134, 0, -0.134]\n\nTeraz możemy obliczyć kolejne składowe wzoru:\n\ncos(30) ≈ 0.866\nsin(30) ≈ 0.5\n\nk x p = [0.134, 0, -0.134]\nsin(θ) * (k x p) = [0.067, 0, -0.067]\n(k * p) * k = [0.536, 0.536, 0.402] * 0.671 ≈ [0.359, 0.359, 0.269]\n(1 - cos(θ)) * (k * p) * k = (1 - 0.866) * [0.359, 0.359, 0.269] ≈ [0.049, 0.049, 0.037]\n\nOstatecznie, podstawiając wszystkie wartości do wzoru, otrzymujemy:\n\n[1, 1, 1] -> [1.438, 1.276, 0.865]\n\nNowy punkt to [1.438, 1.276, 0.865]."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie i połą-": "czonego z końcówką, która porusza się translacyjnie wzdłuż osi łącza.\n\nZałóżmy, że:\n- długość łącza obrotowego to L\n- odległość pomiędzy osią obrotu bazy a osią obrotu łącza to a\n- odległość pomiędzy osią obrotu łącza a osią translacji końcówki to d\n- kąt obrotu łącza to q\n\nZdefiniujmy także ramiona jako R1, R2, R3 i R4, kolejno od bazy do łącza, od łącza do osi translacji końcówki, od osi translacji do punktu chwytu oraz od punktu chwytu do końcówki.\n\nZaczynając od bazy, parametry DH to:\n- R0: a=0, d=0, q=0, alpha=0 (bazowy układ współrzędnych, osie zgodne z układem świata)\n\nPrzechodząc do łącza, parametry DH to:\n- R1: a=0, d=0, q=q, alpha=-pi/2 (obrotowe połączenie ze zmieniającym się kątem, osie x i y obrócone o -pi/2 względem układu bazy)\n\nPrzechodząc do osi translacji końcówki, parametry DH to:\n- R2: a=L, d=0, q=0, alpha=pi/2 (przesuwny połączenie ze stałym kątem 0, osie y i z obrócone o pi/2 względem układu łącza)\n\nPrzechodząc do punktu chwytu, parametry DH to:\n- R3: a=0, d=d, q=0, alpha=-pi/2 (przesuwny połączenie ze stałym kątem 0, osie x i y obrócone o -pi/2 względem układu translacji)\n\nPrzechodząc na końcówkę, parametry DH to:\n- R4: a=0, d=0, q=0, alpha=0 (zwyczajne połączenie, osie zgodne z układem świata)\n\nOstatecznie, zestawienie parametrów DH dla manipulatora opisanego powyżej wygląda następująco:\n- R0: a=0, d=0, q=0, alpha=0\n- R1: a=0, d=0, q=q, alpha=-pi/2\n- R2: a=L, d=0, q=0, alpha=pi/2\n- R3: a=0, d=d, q=0, alpha=-pi/2\n- R4: a=0, d=0, q=0, alpha=0"
      }
    ],
    "#n": 8
  },
  "## Plik. 9": {
    "q&a": [
      {
        "Zad. 1 W jaki sposób zjawisko piezoelektryczne jest wykorzystywane do budowy mikrofonów.": "Zjawisko piezoelektryczne jest wykorzystywane do budowy mikrofonów poprzez wykorzystanie specjalnych kryształów piezoelektrycznych, takich jak kwarc czy turmalin. Kryształ taki jest umieszczany w mikrofonie i poddawany wibracjom wywołanym przez dźwięki, które mają zostać zarejestrowane. Wibracje te wpływają na kryształ piezoelektryczny, który generuje na swoich końcach napięcie elektryczne proporcjonalne do siły tych wibracji. Napięcie to jest następnie wzmacniane i przetwarzane w sygnał dźwiękowy, który może być zapisany lub przesłany na dalsze urządzenia. Dzięki temu właśnie zjawisku piezoelektrycznemu możliwe jest nagrywanie dźwięków i głosów oraz ich przekazywanie za pomocą mikrofonów."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "Tekstu na wyświetlaczu HD44780 można programować za pomocą kontrolera mikroprocesora. Ten kontroler HD44780 jest stosowany w większości sterowników wyświetlaczy LCD. Wykorzystuje on interfejs równoległy do komunikacji z mikrokontrolerem i umożliwia sterowanie wyświetlaczem poprzez komunikację jednokierunkową.\n\nAby wyświetlić tekst na wyświetlaczu HD44780, należy najpierw zainicjować urządzenie. Inicjalizacja składa się z napisania kilku instrukcji, które ustawiają parametry wyświetlacza, takie jak liczba wierszy, tryb kursu lub tryb adresowania. Instrukcje te są wysyłane z mikrokontrolera na kontroler urządzenia poprzez 8-bitową szynę danych i 3 przewody sterujące.\n\nPo zainicjowaniu wyświetlacza, możemy wyświetlić tekst korzystając z następujących instrukcji:\n\n1. CGRAM (Character Generator RAM) – używane do zapisania niestandardowych znaków\n\n2. DDRAM (Display Data RAM) – używane do wyświetlania tekstu na ekranie\n\nNastępnie, musimy ustawić pozycję kursora, aby wiedzieć, gdzie umieścić tekst. Ustawienie pozycji kursora odbywa się za pomocą instrukcji DDRAM, która umieszcza kursor w określonym miejscu.\n\nOto przykładowy kod programowania wyświetlacza HD44780 w języku C:\n\n#include \"lcd.h\" // plik nagłówkowy dla obsługi wyświetlacza\n\nint main(void)\n{\n LCD_init(); // inicjalizacja wyświetlacza\n LCD_puts(\"Hello World!\"); // wyświetla tekst \"Hello World!\" na ekranie\n while(1);\n\n return 0;\n}\n\nW tym przykładzie \"LCD_init()\" jest funkcją inicjalizacyjną, a \"LCD_puts()\" wyświetla tekst na ekranie. Cały program jest nieskończoną pętlą kontrolną, która zapobiega zakończeniu działania programu."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na bazie i": "posiadającego jeden przegub obrotowy na końcu łącza.\n\nParametry DH można wyznaczyć według następujących kroków:\n\nKrok 1: Oznaczenie osi i przegubów robota.\n\nPrzyjmujemy, że osie robota układu współrzędnych są takie same jak osie DH:\n\n    * oś z przegubu 1 (baza) - osia z\n    * oś z przegubu 2 (obrotowy) - osia x\n\nKrok 2: Określenie zmiennych DH.\n\nW przypadku manipulatora z jednym łączem potrzebujemy czterech zmiennych DH:\n\n    * d - odległość między osiami z i x, jest równa długości łącza\n    * $\\theta$ - kąt pomiędzy osią z a osią x, jest to kąt obrotu przegubu 2\n    * a - odległość między osiami x i y, jest równa 0 dla tego manipulatora\n    * $\\alpha$ - kąt pomiędzy osią x a osią y, jest równy 0 dla tego manipulatora\n\nKrok 3: Określenie macierzy transformacji.\n\nAby określić macierz transformacji z jednego układu współrzędnych do drugiego, trzeba wziąć pod uwagę wartości zmiennych DH. W tym przypadku macierz transformacji wygląda następująco:\n\nc$\\theta$ -s$\\theta$ 0 0\n\ns$\\theta$ c$\\theta$ 0 0\n\n0 0 1 d\n\n0 0 0 1\n\ngdzie c$\\theta$ oznacza cos($\\theta$), a s$\\theta$ oznacza sin($\\theta$).\n\nKrok 4: Wyznaczanie parametrów DH.\n\nNa podstawie macierzy transformacji można wyznaczyć zmiennych DH:\n\n    * $d$ - odległość między osiami z i x, jest równa wartości $d_{4,3}$ = d = łącze\n    * $\\theta$ - kąt obrotu przegubu 2, jest równy wartości atan2($a_{3,2}$, $a_{3,1}$) = atan2(0,1) = 0\n    * $a$ - odległość między osiami x i y, jest równa wartości $a_{1,2}$ = a = 0\n    * $\\alpha$ - kąt pomiędzy osią x a osią y, jest równy wartości atan2($a_{2,3}$, $a_{1,3}$) = atan2(sin($\\theta$), cos($\\theta$)) = $\\theta$\n\nZatem parametry DH dla tego manipulatora to:\n\n    * $d$ = łącze\n    * $\\theta$ = 0\n    * $a$ = 0\n    * $\\alpha$ = $\\theta$ = 0\n\nOstatecznie, macierz transformacji dla tego manipulatora ma postać:\n\n1 0 0 0\n\n0 1 0 0\n\n0 0 1 d\n\n0 0 0 1"
      }
    ],
    "#n": 9
  },
  "## Plik. 10": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania termopary i łańcucha termicznego.": "Termopary to urządzenia pomiarowe, które wykorzystują zjawisko Seebecka do pomiaru temperatury. Zjawisko to polega na powstawaniu siły elektromotorycznej w przewodniku, gdy różnica temperatur jest między jego dwoma końcami. W termoparze składającym się z dwóch różnych metali, powstające siły elektromotoryczne są proporcjonalne do różnicy temperatur między końcami. Ta różnica napięcia jest mierzona i przeliczana na temperaturę za pomocą tabel termostatycznych.\n\nŁańcuch termiczny to system lub proces transportu energii cieplnej z jednego punktu do drugiego, wykorzystujący różne elementy termiczne, takie jak termopary, termometry oporowe czy czujniki temperatury typu RTD. Proces ten wymaga przesyłania energii cieplnej z miejsca o wyższej temperaturze do miejsca o niższej temperaturze. W łańcuchu termicznym ważne jest wyznaczenie strumienia ciepła między źródłem a odbiornikiem, jak również prędkość przepływu ciepła przez poszczególne elementy termiczne. Wykorzystanie łańcucha termicznego jest niezwykle istotne w przemyśle, zwłaszcza w procesach produkcyjnych, gdzie kontrola temperatur jest kluczowa dla zachowania jakości produktów i procesów produkcyjnych."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy (ADC) to urządzenie, które przetwarza sygnał analogowy (np. napięcie) na sygnał cyfrowy (binarny). Istnieją różne sposoby działania, ale najczęściej stosowane to metoda aproksymacji oraz metoda sukcesywnego przybliżania.\n\nMetoda aproksymacji działa na zasadzie porównywania napięcia wejściowego z pewnym napięciem odniesienia i stopniowym zmniejszaniu przedziału, w którym może znajdować się wejściowe napięcie. Wynikowy sygnał cyfrowy odpowiada numerowi kroku, w którym napięcie zostało odnalezione.\n\nMetoda sukcesywnego przybliżania działa na podobnej zasadzie, ale zamiast zmniejszania przedziału, wykorzystuje stopniowe dodawanie lub odejmowanie napięcia odniesienia, aż do momentu, gdy zostanie osiągnięty sygnał wejściowy. Wynikowa liczba cyfrowa reprezentuje ilość kroków, potrzebnych do osiągnięcia sygnału wejściowego.\n\nDo wykonania konwersji analogowo-cyfrowej, musimy wykonać kilka instrukcji:\n\n1. Konfiguracja ADC - ustawienie parametrów pracy, takich jak prędkość konwersji oraz poziom odniesienia.\n\n2. Inicjalizacja ADC - uruchomienie konwertera oraz przygotowanie do pracy.\n\n3. Start konwersji - pobranie próbki sygnału analogowego i przekazanie jej do konwertera.\n\n4. Odczyt wyniku - otrzymanie liczby cyfrowej (np. w postaci rejestru) reprezentującej sygnał analogowy.\n\nW zależności od potrzeb, konwersja może być wykonywana jednorazowo lub w trybie ciągłym. W przypadku pracy w trybie ciągłym, konwersja jest wykonywana automatycznie dla kolejnych próbek sygnału."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": ":\n\n$\\frac{dx}{dt} = kx$\n\ngdzie:\n\n$x$ - wartość mierzona przez czujnik,\n\n$t$ - czas,\n\n$k$ - stała proporcjonalności.\n\nRównanie to opisuje proces, w którym wartość mierzonej przez czujnik wielkości zmienia się proporcjonalnie do jej aktualnej wartości. Stała $k$ określa szybkość zmian wartości mierzonej przez czujnik. Im większa wartość $k$, tym szybciej wartość mierzona będzie się zmniejszać lub zwiększać."
      }
    ],
    "#n": 10
  },
  "## Plik. 11": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania kamery CCD.": "Kamera CCD (Charge-Coupled Device) składa się z matrycy setek tysięcy lub milionów pikseli, z których każdy rejestruje intensywność światła padającego na niego. Piksele te są złożone z pól półprzewodników, które przechowują ładunki elektryczne w sposób proporcjonalny do ilości światła padającego na nie.\n\nW momencie gdy światło pada na piksel, elektrony przenoszą się z pola półprzewodnikowego w kierunku elektrody zasilającej dzięki efektowi fotoelektrycznemu. Następnie, ładunki są przesuwane przez układ poziomych i pionowych przewodów, tak zwany układ sterowania odczytem (ang. readout register), do specjalnego układu analogowo-cyfrowego konwertera (ang. ADC - Analog-to-Digital Converter), który tłumaczy sygnał analogowy na cyfrowy.\n\nIstnieją różne sposoby organizacji przewodów układu sterowania odczytem, ale najczęściej stosowanymi są architektury \"frame transfer\" i \"interline transfer\". W przypadku pierwszej, składającej się z dwóch matryc CCD, jedna matryca zajmuje się zbieraniem naświetlonego obrazu, podczas gdy druga jest używana do realizacji przetwarzania obrazu. W drugim przypadku przewody układu sterowania odczytem są zamontowane wewnątrz pikseli, dzięki czemu jest ona bardziej kompaktowa i osiąga wyższą prędkość niż architektura \"frame transfer\".\n\nW procesie odczytu każdego piksela, sygnał jest wzmacniany i przekształcany w postać cyfrową, a następnie zapisywany w pamięci kamery. W ten sposób, obraz jest tworzony z wielu pikseli, które są odczytywane sekwencyjnie i zapisywane na karcie pamięci kamery.\n\nKamery CCD znajdują zastosowanie w wielu różnych dziedzinach, w tym w systemach telewizyjnych, przemysłowych, medycznych i naukowych. Dzięki ich wysokiej rozdzielczości i czułości na światło, kamery CCD są idealnym wyborem do wykonywania zdjęć i filmów o wysokiej jakości i ostrości."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "impedancja źródłowa.\n\nNie jest jasne, jakie jest pytanie. Proszę podać pełne pytanie."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany jest czujnik opisany równaniem różniczkowym, które opisuje jego zachowanie w czasie:\n\ndy/dt = f(y, t)\n\ngdzie y oznacza stan czujnika, t oznacza czas, a f jest funkcją opisującą sposób, w jaki y zmienia się w czasie.\n\nRównanie to opisuje, jak sygnał pochodzący z czujnika (oznaczony jako y) zmienia się w czasie, w zależności od wartości czasu t oraz charakterystyki czujnika zdefiniowanej przez funkcję f.\n\nRozwiązanie tego równania pozwala na określenie, jak sygnał pochodzący z czujnika będzie zmieniał się w czasie oraz jak reagować na jego zmiany. Rozwiązania tego typu równań są często stosowane w różnych dziedzinach, takich jak fizyka, inżynieria, biologia czy ekonomia, by opisywać i przewidywać zachowanie różnych procesów i zjawisk."
      }
    ],
    "#n": 11
  },
  "## Plik. 12": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Zamieść niezbędne obliczenia.": "Konwerter analogowo-cyfrowy (ADC) jest urządzeniem, które przekształca sygnał analogowy na postać cyfrową. Działanie ADC polega na próbkowaniu sygnału analogowego co określony czas oraz kwantowaniu – przyporządkowaniu wartości cyfrowej do amplitudy próbek. \n\nProces ten można przedstawić następująco:\n\n1. Sygnał analogowy jest podawany na wejście ADC.\n2. Sygnał jest próbkowany z określoną częstotliwością f_s, która jest wyrażana w Hz (np. 10 kHz). \n3. Następnie sygnał jest kwantowany, czyli przetwarzany na wartości dyskretne z określoną rozdzielczością. Rozdzielczość określana jest przez liczbę bitów użytych do zapisu wartości cyfrowej. Im więcej bitów, tym mniejsze skoki między kolejnymi wartościami cyfrowymi. Na przykład: \n   - dla 8 bitów rozdzielczości (typowy zakres 0-255), każda jednostka zmiany sygnału odpowiada zmianie o około 0,4% maksymalnej wartości sygnału.\n   - dla 16 bitów rozdzielczości (typowy zakres 0-65535), każda jednostka zmiany sygnału odpowiada zmianie o około 0,0015% maksymalnej wartości sygnału.\n4. Wartości cyfrowe zostają zapisane w pamięci ADC i są gotowe do przetworzenia przez cyfrowy układ elektroniczny. \n\nObliczenia:\n\nCzęstotliwość próbkowania f_s jest odwrotnością czasu trwania jednej próbki T_s, czyli: \nf_s = 1/T_s\n\nRozdzielczość ADC dla n bitów wynosi:\nR = (V_max - V_min)/(2^n)\n\ngdzie V_max to maksymalna wartość sygnału analogowego, a V_min to minimalna wartość sygnału analogowego. \n\nPrzykładowo, dla ADC o rozdzielczości 12 bitów i zakresie 0-5 V, rozdzielczość wynosi: \nR = (5 V - 0 V)/(2^12) = 0,00122 V\n\nOznacza to, że każda jednostka zmiany sygnału odpowiada zmianie o około 0,024% maksymalnej wartości sygnału."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwoma fazami aktywnymi.\n\nSilnik krokowy to urządzenie, które przekształca impulsy elektryczne dostarczane na jego cewki w ruch mechaniczny. W trybie z pełnym krokiem i jedną fazą aktywną do przeprowadzenia każdego pełnego kroku, potrzebna jest zmiana stanu jednej fazy. W kolejnych etapach, każda cewka zmienia swój stan, co powoduje ruch osi. W przypadku takiego trybu, silnik krokowy obraca się z mniejszą prędkością, ale z większą siłą.\n\nNatomiast w trybie z pełnym krokiem i dwoma fazami aktywnymi, każda kolejna cewka zostaje aktywowana naprzemiennie, dzięki czemu osiągane jest większe przyspieszenie i większa prędkość obrotowa przy mniejszej mocy. Dzięki manipulacji sygnałami elektrycznymi, silnik krokowy obraca się z większą prędkością, ale z mniejszą siłą.\n\nW obu trybach, kontroler silnika krokowego musi ustawić kolejność aktywacji faz, aby zapewnić odpowiedni kierunek ruchu i odpowiednią ilość kroków odpowiednio do wymagań aplikacji. Częstotliwość sygnałów elektrycznych dostarczanych do cewek, decyduje o prędkości obrotowej silnika."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany czujnik może być opisany równaniem różniczkowym w postaci:\n\ny'(t) = f(x(t), y(t), t)\n\ngdzie y jest wartością wyjściową czujnika, x jest wartością wejściową, t jest czasem, a f jest funkcją opisującą charakterystykę czujnika.\n\nW zależności od konkretnego czujnika, funkcja f może mieć różną postać i zależeć od wielu czynników, takich jak temperatura, wilgotność, ciśnienie, natężenie oświetlenia czy intensywność pola magnetycznego.\n\nRównanie różniczkowe opisujące czujnik jest ważne, ponieważ umożliwia predykcję jego zachowania w czasie oraz pozwala na opracowanie odpowiedniej strategii kalibracji i ustawienia."
      }
    ],
    "#n": 12
  },
  "## Plik. 13": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera cyfrowo-analogowego. Zamieść niezbędne obliczenia.": "Konwerter cyfrowo-analogowy (DAC) jest urządzeniem, które przyjmuje cyfrowy sygnał wejściowy i przekształca go na analogowy sygnał wyjściowy. Proces ten polega na przydzieleniu wartości sygnału cyfrowego do odpowiednich poziomów napięcia na wyjściu konwertera.\n\nDAC zwykle składa się z trzech głównych komponentów: rejestru przesuwnego, przetwornika wagowego i wzmacniacza.\n\nRejestr przesuwny służy do przechowywania kolejnych bitów sygnału cyfrowego i przesuwania ich przez system, aby uzyskać kolejne wartości sygnału. Przetwornik wagowy przetwarza wartości bitów z rejestru przesuwnego na napięcia odpowiednie dla każdej wartości. Oddzielne przetworniki wagowe mają różną precyzję, aby osiągnąć odpowiednią jakość sygnału.\n\nWzmacniacz służy do wzmocnienia sygnału wyjściowego do odpowiedniego poziomu napięcia, który będzie odpowiedni dla urządzeń odbiorczych, takich jak głośniki lub przetworniki sygnału.\n\nObliczenia dotyczące działania konwertera cyfrowo-analogowego obejmują dobranie napięć minimalnego i maksymalnego, potrzebnych do uzyskania odpowiedniego zakresu sygnału wyjściowego. Przykładowo, jeśli DAC ma zakres wyjściowy od 0 do 5 woltów i przetwornik wagowy ma 8 bitów, obliczenia będą wyglądać następująco:\n\n- Wartość minimalna sygnału cyfrowego: 00000000 (0)\n- Wartość maksymalna sygnału cyfrowego: 11111111 (255)\n- Zakres wartości przetworzonych na napięcie: 0-5V\n- Wartość napięcia dla każdej wartości sygnału cyfrowego: 5 / 255 = ~0.0196 V\n\nNastępnie, w celu uzyskania wartości sygnału analogowego dla konkretnej wartości cyfrowej, ta wartość zostaje pomnożona przez wartość napięcia dla każdego bitu wagowego i dodana do siebie, aby uzyskać sumaryczną wartość napięcia dla całego sygnału analogowego."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze półprzewodnikowe typu P-N składa się z dwóch warstw półprzewodników z różnymi rodzajami przewodnictwa. Warstwa typu P ma nadmiar dziurek, które są nośnikami ładunków dodatnich, natomiast warstwa typu N ma nadmiar elektronów, które są nośnikami ładunków ujemnych.\n\nW złączu P-N zachodzi zjawisko wyścielania, czyli migracja nośników ładunku na granicy pomiędzy dwoma różnymi typami półprzewodników. W wyniku tego procesu następuje nierównomierne rozłożenie ładunków po obu stronach złącza. Na tej granicy powstaje pole elektryczne, które prowadzi do zatrzymania dalniejszej migracji nośników.\n\nW złączu P-N dochodzi również do zjawiska rekombinacji, czyli spotkania elektronów i dziurek i tworzenia par związanych ladunkowo. Podczas tego procesu powstaje energia, która może być emitowana w postaci fotonów. Ten efekt wykorzystywany jest w diodach LED, gdzie energia emitowana jest w postaci światła.\n\nKolejnym zjawiskiem zachodzącym w złączu P-N jest dioda prostownicza, gdzie połączenie warstwy typu P z dodatnim biegunem zasilacza, a warstwa typu N z ujemnym biegunem pozwala na przepływ prądu jednokierunkowego. Prąd sprzyja dalszej rekombinacji nośników ładunków, co prowadzi do zwiększenia pola elektrycznego na złączu.\n\nOgólnie rzecz biorąc, w złączu P-N zachodzą bardzo interesujące zjawiska, które umożliwiają wykorzystanie półprzewodników w wielu dziedzinach, takich jak elektronika, przemysł, energetyka i wiele innych."
      },
      {
        "Zad. 3 Wyznacz (przybliżoną) liniową charakterystykę wejściowo-wyjściową czujnika, dla którego zebrano doświadczalnie": "następujące pomiary:\n\n| Wejście [V] | Wyjście [mA] |\n|------------|--------------|\n| 0          | 0            |\n| 1.5        | 15           |\n| 2.5        | 25           |\n| 3.5        | 35           |\n| 4.5        | 45           |\n| 5          | 50           |\n\nAby wyznaczyć przybliżoną liniową charakterystykę wejściowo-wyjściową czujnika, musimy znaleźć równanie prostej, która najlepiej odwzoruje te punkty pomiarowe. Możemy to zrobić za pomocą metody najmniejszych kwadratów.\n\nNajpierw wyznaczmy średnie wartości wejścia i wyjścia:\n\n$$\\overline{x} = \\frac{\\sum{x_i}}{n} = \\frac{0 + 1.5 + 2.5 + 3.5 + 4.5 + 5}{6} = 2.5$$\n\n$$\\overline{y} = \\frac{\\sum{y_i}}{n} = \\frac{0 + 15 + 25 + 35 + 45 + 50}{6} = 28.33\\text{ mA}$$\n\nNastępnie wyznaczmy różnice między pomiarami a średnimi wartościami:\n\n$$\\Delta x_i = x_i - \\overline{x}$$\n\n$$\\Delta y_i = y_i - \\overline{y}$$\n\n|i  |$x_i$|$y_i$|$\\Delta x_i$|$\\Delta y_i$|$\\Delta x_i^2$|$\\Delta x_i \\Delta y_i$|\n|---|---|---|---------|---------|------------|-------------|\n|1  |0  |0  |-2.5     |-28.33   |6.25        |70.83        |\n|2  |1.5|15 | -1      |-13.33   |1           |13.33        |\n|3  |2.5|25 | 0.5     |-3.33    |0.25        |-1.67        |\n|4  |3.5|35 | 1.5     | 6.67    |2.25        |10.03        |\n|5  |4.5|45 | 2.5     |16.67    |6.25        |41.67        |\n|6  |5  |50 | 2.5     |21.67    |6.25        |54.17        |\n|Σ  |2.5|28.33|0      |0        |22          |188.33       |\n\nNastępnie wyznaczmy współczynniki prostej przy użyciu wzorów:\n\n$$k = \\frac{\\sum{\\Delta x_i\\Delta y_i}}{\\sum{\\Delta x_i^2}} = \\frac{188.33}{22} = 8.56\\text{ mA/V}$$\n\n$$b = \\overline{y} - k\\overline{x} = 28.33 - 8.56 \\cdot 2.5 = 6.67\\text{ mA}$$\n\nOstatecznie, równanie prostej przybliżającej charakterystykę wejściowo-wyjściową czujnika wynosi:\n\n$$y = 8.56x + 6.67$$\n\nMożemy teraz użyć tego równania, aby przewidzieć wartości wyjścia dla różnych wartości wejścia, które nie były objęte pomiarami eksperymentalnymi. Jednak należy pamiętać, że przybliżona charakterystyka liniowa może nie być dokładna w całym zakresie działania czujnika."
      }
    ],
    "#n": 13
  },
  "## Plik. 14": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij zastosowanie Supervisor-a w oprogramowaniu Webots. Pokaż jak i jakie instrukcje służą do odczytywania": "i modyfikowania parametrów symulacji za pomocą Supervisor-a.\n\nSupervisor w Webots to proces, który zarządza symulacją robotów i środowiska. Jego głównym zadaniem jest kontrolowanie symulacji, w tym modyfikowanie parametrów, odczytywanie informacji o robotach i zmiana zachowania obiektów symulacji. Supervisor korzysta z języka Python, co umożliwia użytkownikom łatwe programowanie interakcji między robotami i środowiskiem symulacyjnym. \n\nAby odczytać parametry symulacji za pomocą Supervisor-a, możemy użyć następujących instrukcji:\n\n```python\ntime_step = int(robot.getBasicTimeStep())\n```\n\nJest to przykład instrukcji, która pobiera wartość podstawowego kroku czasowego używanego w symulacji, który może być później wykorzystany dla potrzeb sterowania robotem.\n\nAby zmienić parametry symulacji, możemy użyć na przykład następującej instrukcji:\n\n```python\nrobot.setJointTargetPosition(joint_names, joint_positions)\n```\n\nJest to instrukcja, która ustawia pozycję stawów robota na określonych pozycjach. Zamiast \"joint_names\" należy podać nazwę stawu, a zamiast \"joint_positions\" - wartość pozycji w radianach. \n\nInną przykładową instrukcją może być:\n\n```python\nrobot_node = supervisor.getFromDef(\"ROBOT\")\ntranslation_field = robot_node.getField(\"translation\")\ntranslation = translation_field.getSFVec3f()\n```\n\nInstrukcja ta pobiera pozycję robota (współrzędne x, y, z) i przypisuje ją do zmiennej \"translation\". \n\nZastosowanie Supervisor-a w Webots jest szczególnie przydatne w przypadku chęci personalizowania parametrów symulacji i dodawania nowych funkcjonalności do robotów. Umożliwia to użytkownikom tworzenie bardziej złożonych programów, które wykorzystują dane z symulacji do tworzenia bardziej interaktywnej i realistycznej wirtualnej rzeczywistości."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość manipulatora SCARA.": "Ruchliwość manipulatora SCARA można obliczyć z użyciem równania:\n\nR = 6 - n - m \n\ngdzie:\nR - ruchliwość manipulatora SCARA\nn - liczba stopni swobody (niezależnych położeń) w płaszczyźnie roboczej ramienia poziomego\nm - liczba stopni swobody w kierunku pionowym (zwykle jeden, dla podnoszenia i opuszczania narzędzia)\n\nDla typowego manipulatora SCARA, który ma trzy stopnie swobody w płaszczyźnie roboczej ramienia poziomego i jeden stopień swobody w kierunku pionowym, ruchliwość wynosi: \n\nR = 6 - 3 - 1 = 2 \n\nOznacza to, że manipulator SCARA może poruszać się w dwóch niezależnych kierunkach w trójwymiarowej przestrzeni roboczej."
      }
    ],
    "#n": 14
  },
  "## Plik. 15": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij pojęcie przekształceń jednorodnych.": "Przekształcenia jednorodne to takie działania matematyczne, które zachowują proporcjonalność między zmiennymi. Oznacza to, że jeśli mnożymy wartości zmiennych przez pewną stałą, to wynik przekształcenia również zostanie pomnożony przez tę samą stałą. \n\nFormalnie, przekształcenie f nazywamy jednorodnym stopnia k, jeśli dla dowolnego x i dowolnej stałej c zachodzi:\n\nf(cx) = c^k * f(x)\n\nPrzykładem przekształcenia jednorodnego jest pierwiastkowanie, ponieważ dla dowolnego x i dowolnej stałej c zachodzi:\n\nsqrt(c * x) = sqrt(c) * sqrt(x)\n\nInnym przykładem są przekształcenia afiniczne, czyli przesunięcia, obroty i skalowania figur geometrycznych. Skalowanie jest przykładem przekształcenia jednorodnego stopnia 2, ponieważ podwojenie długości krawędzi figury skutkuje jej czterokrotnym powiększeniem powierzchni."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość (typowego) manipulatora ramieniowego.": "Ruchliwość manipulatora ramieniowego zależy od liczby stopni swobody (DOF - degrees of freedom), czyli liczby niezależnych kierunków, w których może się poruszać. Typowy manipulator ramieniowy posiada 6 stopni swobody, co oznacza, że może poruszać się w 6 niezależnych kierunkach. \n\nRuchliwość ta jest zwykle wykorzystywana do określenia zdolności manipulatora do wykonywania skomplikowanych ruchów i precyzyjnej kontroli pozycji narzędzia. Im większa jest liczba stopni swobody, tym bardziej zaawansowane zadania manipulator może wykonywać. Jednocześnie większa liczba stopni swobody oznacza zwykle większą złożoność mechanizmu i większe koszty budowy i utrzymania."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie": "Zadanie:\n\nRozważmy manipulator złożony z jednego łącza obrotowego zamontowanego na bazie. Kąt obrotu łącza wynosi 30 stopni na sekundę. Jakie jest prędkości liniowe i kątowe końca manipulatora znajdującego się w odległości 0.5m od osi obrotu?\n\nRozwiązanie:\n\nPrędkość kątowa łącza można zapisać jako:\n\nω = 30°/s = 0.524 rad/s\n\nPrędkość liniowa końca manipulatora można obliczyć jako:\n\nv = ω * r\n\ngdzie r = 0.5m jest odległością końca manipulatora od osi obrotu.\n\nv = 0,524 rad/s * 0,5 m = 0,262 m/s\n\nPrędkość kątowa końca manipulatora jest taka sama jak prędkość kątowa łącza.\n\nω_konca = ω = 0.524 rad/s\n\nOdpowiedź:\n\nPrędkość liniowa końca manipulatora wynosi 0.262 m/s, a prędkość kątowa końca manipulatora wynosi 0.524 rad/s."
      }
    ],
    "#n": 15
  },
  "## Plik. 16": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij przeznaczenie poszczególnych bitów rejestru STATUS.": "Rejestr STATUS jest rejstrem wewnętrznym procesora, który zawiera informacje o stanie procesora oraz wynikach ostatnio wykonanych operacji.\n\nPoszczególne bity rejestru STATUS pełnią następujące funkcje:\n\n- bit C (Carry) - przeniesienie po wykonaniu operacji arytmetycznej lub logicznej\n- bit DC (Digit Carry) - przeniesienie w przypadku operacji na cyfrach dziesiętnych\n- bit Z (Zero) - wynik ostatniej operacji był równy zeru\n- bit PD (Power Down) - procesor znajduje się w trybie oszczędzania energii\n- bit TO (Time-out) - wystąpiło przerwanie zegara wewnętrznego\n- bit RP0 (Register Bank Select) - wybór banku rejestrów\n- bit IRP (Register Bank Select) - wybór banku rejestrów\n- bit n/A (Not Applicable) - niewykorzystywany\n\nKażdy z bitów rejestru STATUS ma swoje unikalne przeznaczenie, które zależy od trybu pracy procesora i wykonywanych operacji. Na podstawie stanu rejestrów można kontrolować przebieg programu i podejmować dalsze decyzje w zależności od wyników operacji."
      },
      {
        "Zad. 2 Wykonaj obrót punktu [1,1,1]o30◦dookoła wektora [0.5,0.4,0.3]. Zamieść odpowiednie obliczenia.": "W pierwszej kolejności należy przekształcić wektor [0.5,0.4,0.3] na wektor jednostkowy, dzieląc go przez jego długość:\n\n||[0.5,0.4,0.3]|| = sqrt(0.5^2 + 0.4^2 + 0.3^2) = 0.744\n\n[0.5,0.4,0.3]/0.744 = [0.671,0.536,0.402]\n\nNastępnie, korzystając z wzoru na macierz obrotu dla dowolnego kąta i osi, mamy:\n\n|cosθ+(1-cosθ)a_x^2    a_xa_y(1-cosθ)-a_zsinθ  a_xa_z(1-cosθ)+a_ysinθ|\n|a_ya_x(1-cosθ)+a_zsinθ cosθ+(1-cosθ)a_y^2    a_ya_z(1-cosθ)-a_xsinθ|\n|a_za_x(1-cosθ)-a_ysinθ a_za_y(1-cosθ)+a_xsinθ cosθ+(1-cosθ)a_z^2   |\n\nDla naszych danych, wartości a_x, a_y, a_z to odpowiednio 0.671, 0.536 i 0.402, a kąt obrotu θ to 30 stopni. Podstawiając te wartości, otrzymujemy:\n\n|0.868  -0.350  0.350 |\n|0.350   0.936 -0.002 |\n|-0.350  0.002  0.936|\n\nOstatecznie, wykonując mnożenie macierzowe punktu [1,1,1] przez uzyskaną powyżej macierz obrotu, otrzymujemy:\n\n[0.868,0.650,1.286]"
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na": "podstawie obrotowej. Zakładając, że pozioma podstawa obrotowa porusza się z prędkością stałą, a łącze porusza się wzdłuż osi pryzmatu z prędkością proporcjonalną do kąta obrotu podstawy.\n\nRozwiązanie:\n\nDla prostoty przyjmujemy, że manipulator porusza się tylko w jednym wymiarze (os X). Oznaczamy przez:\n\n- θ(t): kąt obrotu podstawy w czasie t\n- x(t): położenie końca łącza w czasie t\n- L: długość łącza\n\nZ treści zadania wynika, że prędkość kątowa podstawy jest stała, czyli:\n\ndθ/dt = const.\n\nNatomiast prędkość liniowa końca łącza jest proporcjonalna do prędkości kątowej podstawy, czyli:\n\ndx/dt = k * dθ/dt\n\ngdzie k jest stałą proporcjonalności.\n\nZauważamy, że łącze porusza się po linii prostej, więc jego przemieszczenie można opisać za pomocą funkcji liniowej:\n\nx(t) = a * θ(t) + b\n\ngdzie a i b są stałymi do wyznaczenia. Wykorzystując warunek początkowy x(0) = 0, otrzymujemy:\n\nb = 0\n\nTeraz musimy obliczyć wartość stałej a. Do tego celu wykorzystujemy drugi warunek:\n\ndx/dt = k * dθ/dt\n\nOznaczając pochodną kąta jako ω = dθ/dt, mamy:\n\na * ω = k * ω\n\nstąd:\n\na = k\n\nW rezultacie otrzymujemy równanie opisujące położenie końca łącza w czasie t:\n\nx(t) = k * θ(t)\n\nTeraz możemy obliczyć prędkość i przyspieszenie końca łącza. Prędkość to pochodna po czasie:\n\nv(t) = dx/dt = k * dθ/dt = k * ω\n\nZ kolei przyspieszenie to druga pochodna po czasie:\n\na(t) = dv/dt = k * dω/dt\n\nAby wyznaczyć dω/dt, musimy skorzystać z faktu, że prędkość kątowa jest stała:\n\ndω/dt = 0\n\nStąd:\n\na(t) = 0\n\nOznacza to, że przyspieszenie końca łącza jest zerowe, czyli ruch jest jednostajny z prędkością v = k * ω."
      }
    ],
    "#n": 16
  },
  "## Plik. 17": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci programu w mikrokontrolerze PIC16f877A.": "Mikrokontroler PIC16f877A ma 13-bitową przestrzeń adresową, co oznacza, że ​​może obsługiwać do 8KB pamięci. Sposoby adresacji pamięci programu w mikrokontrolerze PIC16f877A obejmują:\n\n1. Bezpośrednia adresacja - używa bezpośredniego adresu 8-bitowego, który wskazuje na konkretny bajt pamięci. Na przykład, instrukcja \"MOVLW 0x0A\" ładuje wartość 0x0A do rejestru W, a instrukcja \"MOVWF 0x20\" zapisuje wartość w rejestrze W do adresu 0x20 w pamięci.\n\n2. Bezpośrednia adresacja z przesunięciem - używa bezpośredniego adresu 8-bitowego i stałej względnej, która określa przesunięcie od adresu bazowego. Na przykład, instrukcja \"MOVLW 0x0A\" ładuje wartość 0x0A do rejestru W, a instrukcja \"MOVWF 0x20+2\" zapisuje wartość w rejestrze W do adresu 0x22 w pamięci (0x20 + 2).\n\n3. Indyrekcyjna adresacja - używa wartości z rejestru, aby wyznaczyć adres pamięci. Na przykład, instrukcja \"MOVLW 0x10\" ładuje wartość 0x10 do rejestru W, a instrukcja \"MOVWF FSR\" ustawia FSR na adres 0x10. Następnie instrukcja \"MOVWF [FSR]\" zapisuje wartość w rejestrze W do adresu wskazywanego przez FSR.\n\n4. Indyrekcyjna adresacja z przesunięciem - używa rejestru i stałej względnej, aby wyznaczyć adres pamięci. Na przykład, instrukcja \"MOVLW 0x10\" ładuje wartość 0x10 do rejestru W, a instrukcja \"MOVWF FSR\" ustawia FSR na adres 0x10. Następnie instrukcja \"MOVWF [FSR+2]\" zapisuje wartość w rejestrze W do adresu 0x12 (0x10 + 2) wskazywanego przez FSR.\n\n5. Adresacja stała - używa bezpośredniej wartości stałej jako adresu pamięci. Na przykład, instrukcja \"MOVLW 0x0A\" ładuje wartość 0x0A do rejestru W, a instrukcja \"GOTO 0x100\" przeskakuje do adresu 0x100 w pamięci.\n\n6. Rozszerzona adresacja - używa 21-bitowego adresu do dostępu do większej pamięci. Ta forma adresacji jest dostępna tylko w pewnych trybach pracy i niektórych układach, a nie w standardowym trybie pracy PIC16f877A."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "Tekst na wyświetlaczu HD44780 można programować za pomocą mikrokontrolera lub innego urządzenia. Istnieje kilka metod programowania HD44780, ale poniżej przedstawiono najpopularniejszą.\n\nChcąc programować wyświetlacz HD44780, najpierw należy skonfigurować porty mikrokontrolera, które będą bezpośrednio połączone z wyświetlaczem. Następnie należy dokładnie zapoznać się z instrukcjami obsługi LCD.\n\nW HD44780 są cztery rejestry:\n\n1. Rejestr instrukcji - umożliwia przesyłanie poleceń do wyświetlacza, takich jak włączenie, wyłączenie wyświetlacza.\n\n2. Rejestr danych - umożliwia przesyłanie danych do wyświetlacza.\n\n3. Rejestr adresowy - kontroluje pozycję kursora.\n\n4. Rejestr trybu pracy - kontorluje tryb pracy wyświetlacza.\n\nNajważniejszymi instrukcjami dla programowania wyświetlacza HD44780 są:\n\n1. Instrukcja ustawienia trybu pracy - \"Function set\". Dzięki niej kodujemy parametry trybu pracy wyświetlacza, takie jak: liczba wierszy (1 lub 2), wielkość czcionki, interfejs danych (4-bitowy lub 8-bitowy), tryb pracy (zwykły lub rozszerzony).\n\n2. Instrukcja czyszczenia ekranu - \"Clear Display\". Usuwa cały tekst z wyświetlacza i przenosi kursor na pozycję początkową.\n\n3. Instrukcja ustawienia pozycji kursora - \"Set DDRAM Address\". Pozwala na ustawienie pozycji kursora na wyświetlaczu.\n\n4. Instrukcja ustawienia kierunku tekstu - \"Entry Mode Set\". Ustawia kierunek tekstu na wyświetlaczu i sposób przesuwania kursora po wpisaniu kolejnego znaku.\n\n5. Instrukcja wpisywania danych - \"Write Data\". Wpisuje pojedynczy znak na wyświetlacz.\n\n6. Instrukcja odczytania danych - \"Read Data\". Pozwala na odczytanie danych z wyświetlacza.\n\nZ uwagi na złożoność procesu programowania, zaleca się korzystać z gotowych bibliotek do obsługi wyświetlacza HD44780. Dostępne są biblioteki dla różnych mikrokontrolerów i języków programowania."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie i połą-": "czonego z jednym łączem przegubowym.\n\nAby wyznaczyć parametry DH (Denavit-Hartenberg) dla tego manipulatora, należy przeprowadzić następujące kroki:\n\n1. Wybierz układ odniesienia: W przypadku tego manipulatora należy wybrać bieżący układ odniesienia (B), który znajduje się na bazie.\n\n2. Określ kierunek ruchu poprzecznego: Kierunek ruchu poprzecznego łącza obrotowego (jednostopniowy) jest prostopadły do osi obrotu, zatem kierunek ten jest wyznaczony przez wektor jednostkowy i_hat = [1, 0, 0]^T.\n\n3. Zdefiniuj osie obrotu i układy współrzędnych: W przypadku jednostopniowego łącza obrotowego wystarczy zdefiniować jedną oś obrotu (z), która jest równoległa do osi obrotu łącza. Aby określić układy współrzędnych dla poszczególnych łącz, należy zdefiniować układ współrzędnych związany z poprzednim łączem (lub z układem bazowym w przypadku pierwszego łącza) oraz układ współrzędnych związany z obecnym łączem.\n\n4. Określ punkt wspólny: Ponieważ manipulator składa się tylko z jednego łącza obrotowego i jednego łącza przegubowego, punkt wspólny można zdefiniować jako początek łącza obrotowego (w środku bazy).\n\n5. Określ wartości parametrów DH: Po określeniu osi obrotów i punktu wspólnego oraz zdefiniowaniu układów współrzędnych dla poszczególnych łącz, można wyznaczyć wartości parametrów DH dla każdego łącza:\n\n- a_i: Długość prostopadłej odległości między osią z_{i-1} a z_i wzdłuż osi x_{i-1}.\n- alpha_i: Kąt między osią z_{i-1} a z_i wzdłuż osi x_{i-1}.\n- d_i: Długość między osią z_{i-1} a z_i wzdłuż osi z_i.\n- theta_i: Kąt między osią x_{i-1} a x_i wzdłuż osi z_i.\n\nW przypadku tego manipulatora, parametry DH dla obu łącz wynoszą:\n\n- łącze obrotowe:\n\n  - a_1 = 0\n  - alpha_1 = 0\n  - d_1 = 0\n  - theta_1 = q_1 (zmienna kątowa)\n\n- łącze przegubowe:\n\n  - a_2 = 0\n  - alpha_2 = 0\n  - d_2 = L (stała długość łącza)\n  - theta_2 = q_2 (zmienna kątowa)\n\ngdzie q_1 i q_2 oznaczają kąt obrotu łącz pierwszego i drugiego odpowiednio."
      }
    ],
    "#n": 17
  },
  "## Plik. 18": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci danych w mikrokontrolerze PIC16f877A.": "Mikrokontroler PIC16f877A używa dwóch sposobów adresacji pamięci danych: bezpośredniej i pośredniej.\n\nAdresowanie bezpośrednie polega na bezpośrednim odwołaniu do konkretnego adresu pamięci, w którym znajduje się dane. Adres ten może zostać zdefiniowany w kodzie programu lub pobrany z rejestru. W przypadku PIC16f877A, zakres adresowania bezpośredniego wynosi od 0x00 do 0xFF i odnosi się do rejestrów wewnętrznych, pamięci RAM oraz pamięci EEPROM.\n\nAdresowanie pośrednie jest używane, gdy konkretny adres danych jest nieznany lub wymaga dynamicznego określenia. W takim przypadku, adres danych jest zapisywany w rejestrze specjalnym, wskazującym na kolejny adres, który zawiera właściwe dane. W PIC16f877A adresowanie pośrednie jest realizowane poprzez rejestry WREG, FSR oraz PCLATH.\n\nRejestr WREG (Working Register) służy do przechowywania wartości tymczasowych lub do realizowania operacji arytmetycznych. W przypadku adresowania pośredniego, wartość adresu pamięci jest zapisywana w rejestrze WREG.\n\nRejestr FSR (File Select Register) umożliwia wybór jednego z banków rejestrów, w którym znajduje się adres pamięci. Wartość zapisana w rejestrze FSR jest dodawana do wartości z rejestru WREG, tworząc pełen adres pamięci.\n\nRejestr PCLATH (Program Counter Latch High) służy do przechowywania części wysokiej adresu pamięci programu. W przypadku adresowania pośredniego w pamięci programu, wartość z rejestrów FSR i WREG dodawana jest do wartości PCLATH, aby utworzyć pełny adres."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy (ADC) jest urządzeniem, które przekształca sygnał analogowy na sygnał cyfrowy. Sposób działania konwertera polega na porównywaniu sygnału wejściowego z sygnałem referencyjnym i przekształceniu otrzymanej różnicy na sygnał cyfrowy.\n\nW procesie przekształcania sygnału analogowego na cyfrowy, istotne są trzy etapy:\n\n1. Próbkowanie: polega na pobieraniu próbek sygnału analogowego w ustalonych odstępach czasowych.\n\n2. Kwantowanie: polega na przypisaniu wartości cyfrowej dla każdej pobranej próbki sygnału analogowego.\n\n3. Kodowanie: polega na zapisaniu wartości cyfrowej w konkretnym formacie (np. binarnym).\n\nAby uruchomić konwerter analogowo-cyfrowy, należy wykonać kilka instrukcji:\n\n1. Wybrać odpowiedni tryb i konfigurację pracy.\n\n2. Ustawić parametry sygnału wejściowego, takie jak zakres pomiarowy, częstotliwość próbkowania, poziom sygnału referencyjnego.\n\n3. Uruchomić konwersję i przekazać pobrane próbki do procesora lub mikrokontrolera.\n\n4. Odczytać wartości cyfrowe i dokonać dalszej obróbki lub analizy sygnału.\n\nKonwertery analogowo-cyfrowe są powszechnie stosowane w systemach pomiarowych, przetwarzaniu sygnałów, regulacji i kontroli procesów przemysłowych oraz w elektronice użytkowej (np. w kamerach cyfrowych, smartfonach, czy tabletach)."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na bazie i": "dwóch osi obrotowych:\n\n1. Długość łącza pryzmatycznego: d1\n2. Odległość osi obrotowej pierwszego przegubu od bazy: a1\n3. Odległość osi obrotowej drugiego przegubu od końca łącza pryzmatycznego: a2\n\nWyznaczanie parametrów DH polega na przypisaniu układu współrzędnych do każdego z przegubów robota oraz opracowaniu macierzy transformacji jednego układu do drugiego. Schemat DH dla manipulatora składającego się z trzech przegubów opisuje się następującymi przekształceniami:\n\n1. Piasty – Translacja wzdłuż osi Z (zdjęcia ramienia od korpusu) o d1\n2. Główny korpus – Obrót wokół osi Z (pozostaje stałe)\n3. (Pierwszy przegub) – Translacja wzdłuż osi X przesunięcie o a1 wzdłuż Z\n4. (Drugi przegub) – Translacja wzdłuż osi X przesunięcie o a2 wzdłuż Z.\n\nDefiniowanie parametrów DH powinno poprawić wałki obracające się wokół osi oraz przemieszczenia po osiach robota. Dzięki temu będzie możliwe zaprojektowanie trajektorii ruchu robota, które pozwolą na czyszczenie von Neumanna czy programowanie podobnych zadań."
      }
    ],
    "#n": 18
  },
  "## Plik. 19": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz elementy pamięci programu mikrokontrolera PIC16f877A.": "Mikrokontroler PIC16f877A posiada następujące elementy pamięci:\n\n1. Pamięć flash - służy do przechowywania programu użytkownika, który jest zapisywany czytelnym kodem asemblera i przechowywany w pamięci flash. Ta pamięć jest nieulotna i pozwala na programowanie mikrokontrolera.\n\n2. Pamięć EEPROM - ta pamięć jest również nieulotna i służy do przechowywania danych, które są zaprogramowane na stałe i nie ulegają zmianie. Płytka rozwojowa mikrokontrolera PIC16f877A ma 256 bajtów pamięci EEPROM.\n\n3. Pamięć RAM - ta pamięć jest ulotna i służy do przechowywania danych podczas działania programu. Pamięć RAM ma pojemność 368 bajtów.\n\n4. Pamięć rejestrowa - mikrokontrolery PIC mają wiele rejestrów, które służą do wykonywania różnych operacji i przechowywania danych tymczasowych.\n\n5. Pamięć programowa - służy do przechowywania specjalnych instrukcji, które pozwalają na kontrolowanie działania mikrokontrolera.\n\nW sumie PIC16f877A oferuje aż 14-bitowe adresowanie, przy jednoczesnym braku stronicowania, co daje dość duży zakres zastosowań i łatwość programowania."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "rezystancja obciążenia.\n\nNie ma rysunku dołączonego do pytania, więc nie możemy dokładnie ocenić, jak wygląda ten układ. Podstawowe informacje, które podano, to impedancja układu zasilania (R1=50Ω) i rezystancja obciążenia (Rs=300Ω). Mogą one być stosowane do obliczenia wartości prądu i napięcia w układzie, ale konkretny wynik zależy od rodzaju układu i innych elementów składowych."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "y(t) = a * u(t) - b * y(t-1)\n\ngdzie y(t) oznacza wartość wyjściową czujnika w chwili t, u(t) to sygnał wejściowy, a i b to stałe współczynniki charakteryzujące właściwości czujnika. Równanie to opisuje dynamiczne zachowanie czujnika, gdzie jego wyjście zależy nie tylko od sygnału wejściowego w danej chwili, ale także od wyjścia z poprzedniej chwili."
      }
    ],
    "#n": 19
  },
  "## Plik. 20": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz podstawowe elementy pamięci mikrokontrolera PIC16f877A.": "Podstawowe elementy pamięci mikrokontrolera PIC16f877A to:\n\n1. Flash - pamięć programu, która przechowuje kod programu. Jest nieulotna i może zostać zaktualizowana przez programowanie.\n\n2. EEPROM - elektrycznie kasowalna i programowalna pamięć tylko do odczytu, która przechowuje dane, takie jak zmienne i stałe. Jest trwale zapisana nawet po odłączeniu zasilania.\n\n3. SRAM - pamięć RAM, która służy jako szybka pamięć robocza dla programu i danych, które aktualnie są używane. Jest ulotna i traci dane po odłączeniu zasilania.\n\n4. Special Function Registers (SFRs) - pamięć specjalna, która przechowuje informacje o konfiguracji i stanu mikrokontrolera, takie jak status flagi, rejestry wejściowe/wyjściowe i liczniki zegarowe.\n\n5. Stos - obszar pamięci, który przechowuje dane stosowane w czasie wykonywania programu, takie jak zmienne lokalne i adresy powrotu z funkcji.\n\n6. Dane programowe - obszar w pamięci flash, który przechowuje dane liczbowe i tekstowe, takie jak stałe i tablice.\n\n7. We/wy porty - służą do komunikacji z urządzeniami zewnętrznymi, takimi jak czujniki, przetworniki i wyświetlacze."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwoma fazami aktywnymi.\n\nSilnik krokowy to akcyjni element elektryczny, który przekształca sygnały elektryczne na ruch mechaniczny. Silnik krokowy składa się z rdzenia magnetycznego i cewek elektromagnetycznych zamocowanych na jego obwodach. Każda cewka jest podłączona do zewnętrznego układu sterującego, który dostarcza sygnał sterujący.\n\nTryb z pełnym krokiem i jedną fazą aktywną polega na podawaniu na cewkę elektromagnetyczną kolejno dwóch sygnałów: jednego do zasilania cewki i drugiego do uziemienia cewki. Kiedy cewka jest zasilana, rdzeń magnetyczny powoduje obrót wału silnika krokowego o ustalony kąt (krok). Następnie sygnał do cewki jest odłączany, a druga cewka jest zasilana, co powoduje kolejny krok.\n\nW trybie z pełnym krokiem i dwoma fazami aktywnymi na każdą z cewek jest podawany sygnał sterujący. Prąd przepływający przez cewki zmienia polaryzację magnesów i powoduje obrót wału o ustalony kąt. W trybie tym każdy krok jest rozdzielony na dwa etapy, a precyzja ruchu jest wyższa.\n\nW obu przypadkach ruch silnika jest kontrolowany za pomocą sygnałów sterujących i umożliwia precyzyjne wykonywanie ruchów o ustalonej wielkości kroku. Silniki krokowe wykorzystywane są w urządzeniach mechanicznych, takich jak drukarki, skanery, maszyny do obróbki metali, a także w robotyce i automatyce przemysłowej."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany czujnik można opisać za pomocą równania różniczkowego postaci:\n\n\\begin{equation}\n\\frac{d}{dt}y(t) = f(y(t), u(t), t)\n\\end{equation}\n\ngdzie:\n\n- $y(t)$ to wyjście (odczyt) czujnika w czasie $t$,\n- $u(t)$ to wejście (warunki pracy) czujnika w czasie $t$,\n- $f(y(t), u(t), t)$ to funkcja opisująca charakterystykę czujnika.\n\nPrzykładem funkcji opisującej charakterystykę czujnika może być równanie opisujące zależność między wartością wyjściową czujnika a wartością mierzonej wielkości fizycznej. Dla przykładu, czujnik temperatury może mieć zależność opisaną równaniem:\n\n\\begin{equation}\n\\frac{d}{dt}y(t) = k(T_{wew}(t) - y(t))\n\\end{equation}\n\ngdzie:\n\n- $k$ to współczynnik proporcjonalności czujnika,\n- $T_{wew}(t)$ to temperatura wewnętrzna,\n- $y(t)$ to odczyt temperatury dokonany przez czujnik w czasie $t$.\n\nRównanie to mówi nam, że wartość wyjściowa czujnika zależy od różnicy temperatury między jego wnętrzem a otoczeniem oraz od współczynnika proporcjonalności."
      }
    ],
    "#n": 20
  },
  "## Plik. 21": {
    "q&a": [
      {
        "Zad. 1 Opisz sposób działania stosu i instrukcje wykorzystywane do jego obsługi w mikrokontrolerach klasy PIC18fxx2 i": "Stos w mikrokontrolerach klasy PIC18Fxx2 jest obsługiwany przez dwa rejestry: SP i WREG.\n\nSP (Stack Pointer) przechowuje adres w pamięci, gdzie znajduje się ostatni zapisany na stosie element. Początkowo SP ustawiany jest na najwyższy adres w pamięci zaalokowanym na stos. Przy dodawaniu nowego elementu na stos SP jest dekrementowany, a przy zdejmowaniu elementu ze stosu SP jest inkrementowany.\n\nWREG (Working Register) to rejestr specjalnego przeznaczenia, który służy do przechowywania wartości tymczasowych w trakcie wykonywania programu. W przypadku stosu, WREG służy do przechowywania wartości, która ma zostać dodana na stos lub pobrana ze stosu.\n\nInstrukcje wykorzystywane do obsługi stosu w mikrokontrolerach klasy PIC18Fxx2 to:\n\n- PUSH: dodaje wartość z rejestru WREG na stos, dekrementuje SP\n- POP: pobiera wartość ze stosu i zapisuje ją do rejestru WREG, inkrementuje SP\n- CALL: dodaje adres powrotu na stos, dekrementuje SP, skacze do procedury\n- RETURN: pobiera adres powrotu ze stosu, inkrementuje SP, wraca do miejsca, z którego zostało wywołane CALL\n\nDodatkowo, w mikrokontrolerach tej klasy stos wykorzystywany jest również do przechowywania rejestrów kontekstu podczas przerwania, za których obsługę odpowiada reguła LIFO (Last-In-First-Out), czyli ostatni zapisany element jest jako pierwszy pobierany ze stosu. Do obsługi przerwań stosowane są specjalne instrukcje, takie jak:\n\n- PUSHALL: dodaje na stos wszystkie rejestry ogólnego przeznaczenia oraz rejestr statusu\n- POPALL: pobiera ze stosu wartości wszystkich rejestrów ogólnego przeznaczenia oraz rejestr statusu\n\nDzięki stosowi można łatwo przekazywać argumenty i zmienna lokalne między różnymi częściami programu, a także zapisywać i odczytywać adresy powrotu do i z procedur. Stos ma również zastosowanie w obsłudze przerwań, gdzie pozwala na zachowanie kontekstu programu przed jego wykonaniem."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze P-N to złącze pomiędzy półprzewodnikami typu P (ang. positive) i N (ang. negative) o różnych typach (typ P zawiera domieszkę akceptorową, a typ N zawiera domieszkę donorową).\n\nZjawiska zachodzące w złączu P-N to:\n\n1. Bariera potencjału: W złączu P-N, półprzewodnik typu P i typu N tworzą barierę potencjału, która pozwala na kontrolowanie przepływu prądu przez złącze. Elektrony w półprzewodniku N będą skłaniać się do ruchu w kierunku złącza, a dziura w półprzewodniku P będzie skłaniać się do ruchu w przeciwnym kierunku.\n\n2. Diodowy efekt prostowniczy: Złącza P-N mogą służyć do prostowania prądu w obwodzie elektrycznym. Kiedy anoda diody jest podłączona do złącza typu P, a katoda diody jest podłączona do złącza typu N, prąd może płynąć tylko w jednym kierunku przez złącze, co powoduje, że dioda działa jak prostownik prądu.\n\n3. Efekt pojemnościowy: Złącza P-N są wrażliwe na zmiany napięcia, co powoduje zmianę pojemności złącza w zależności od napięcia na złączu. Pojemność ta wpływa na prąd przepływający przez złącze i może wprowadzać opóźnienia sygnału, co jest istotne w zastosowaniach elektronicznych.\n\n4. Efekt tunelowy: W złączach P-N może wystąpić efekt tunelowy, w którym elektrony są transferowane przez barierę potencjału, co pozwala na przepływ prądu między złączami w kierunku przeciwnym do kierunku normalnego przepływu prądu.\n\n5. Zjawisko rekombinacji: Przy dostatecznie dużym zasilaniu, elektrony i dziury w złączu P-N mogą rekombinować ze sobą, co powoduje generowanie ciepła i zmniejszenie wydajności złącza."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dla uproszczenia załóżmy, że dany jest czujnik temperatury, oznaczmy jego wyjście przez T(t) [C]. Równanie różniczkowe opisujące jego zachowanie może wyglądać następująco:\n\ndT/dt = q(T, t)\n\ngdzie q(T, t) jest funkcją czasu i temperatury, opisującą sposób, w jaki czujnik reaguje na zmiany temperatury w otoczeniu. Funkcja ta może mieć różne postaci w zależności od rodzaju czujnika i jego konstrukcji.\n\nRozwiązanie tego równania differentyjnego pozwala określić, jak temperatura na wyjściu czujnika zmienia się w czasie, przy różnych stanach początkowych i warunkach zewnętrznych (np. zmieniająca się temperatura otoczenia). Można też na jego podstawie wyprowadzić parametry charakteryzujące działanie czujnika, takie jak czas reakcji, czułość czy dokładność pomiaru."
      }
    ],
    "#n": 21
  },
  "## Plik. 22": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij znaczenie ﬂag konﬁguracji w mikrokontrolerze PIC16f877A": "Flagi konfiguracji w mikrokontrolerze PIC16f877A służą do ustawiania trybu pracy mikrokontrolera oraz konfiguracji jego peryferiów. Flagi te są przechowywane w specjalnej komórce pamięci o nazwie rejestru konfiguracji. Konfiguracja ta może być ustawiana przez programistę lub automatycznie przez mikrokontroler w zależności od potrzeb.\n\nPrzykładowe ustawienia, które można dokonać za pomocą flag konfiguracyjnych to:\n- wybór trybu oscylatora (wewnętrznego lub zewnętrznego)\n- ustawienia trybu pracy układu taktującego (zegar synchroniczny lub asynchroniczny)\n- ustawienia przerwań (włączanie i wyłączanie poszczególnych rodzajów przerwań)\n- konfiguracja układów peryferyjnych (np. modułu ADC)\n\nFlagi konfiguracyjne umożliwiają dostosowanie mikrokontrolera do konkretnych wymagań aplikacji. Prawidłowa konfiguracja pozwala na optymalne wykorzystanie zasobów mikrokontrolera oraz zapewnia jego stabilną i bezpieczną pracę."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość manipulatora SCARA.": "Aby obliczyć ruchliwość manipulatora SCARA, należy użyć wzoru:\n\nruchliwość = liczba stopni swobody - liczba ograniczeń\n\nLiczba stopni swobody to liczba niezależnych ruchów, jakie może wykonywać manipulator. W przypadku manipulatora SCARA są to:\n\n- Ruch pionowy (z)\n- Ruch poziomy a (x)\n- Ruch poziomy b (y)\n- Obrót końcówki (θ)\n\nLiczba ograniczeń to liczba warunków, które muszą być spełnione, aby manipulator mógł się poruszać. W przypadku manipulatora SCARA są to:\n\n- Wiązka postaci ramienia (ramię nie może wyginąć)\n- Połączenie między końcówką a punktem, gdzie osie ruchu x i y się przecinają (końcówka nie może się przemieścić wolno w pionie)\n\nW związku z tym ruchliwość manipulatora SCARA to:\n\nruchliwość = 4 - 2 = 2\n\nManipulator SCARA ma ruchliwość równą 2."
      },
      {
        "Zad. 3 Wyznacz (przybliżoną) liniową charakterystykę wejściowo-wyjściową czujnika, dla którego zebrano doświadczalnie": "Liniowa charakterystyka wejściowo-wyjściowa czujnika to zależność pomiędzy wartością zmierzoną przez czujnik a wartością wyjścia elektrońskiego. Aby wyznaczyć liniową charakterystykę, należy zbadać pomiar dla różnych wartości wejściowych i wyjściowych.\n\nNa przykład, jeśli zmierzono wartości napięcia wejściowego i odpowiadające wartości napięcia wyjściowego czujnika, można przedstawić te wartości na wykresie rozproszenia. Następnie, aby uzyskać charakterystykę liniową, wykonuje się regresję liniową dla punktów i rysuje się prostą, która najlepiej odzwierciedla zależność między wejściem a wyjściem czujnika.\n\nPrzykładowo, mając takie pomiary:\n\nWejście: 1, 2, 3, 4, 5\nWyjście: 2, 4, 6, 8, 10\n\nMożemy przedstawić je na wykresie rozproszenia i wykonać regresję liniową:\n\nWykres: \n\n![Wykres_liniowy](https://i.imgur.com/hnTmtEd.png)\n\nRegresja liniowa: \n\n`y = 2x`\n\nProsta ta będzie przybliżoną charakterystyką liniową czujnika."
      }
    ],
    "#n": 22
  },
  "## Plik. 23": {
    "q&a": [
      {
        "Zad. 1 Czym jest histereza w układach wejściowo-wyjściowych.": "Histereza to stan, w którym wartość wyjściowa układu zależy nie tylko od wartości bieżącej wartości wejściowej, ale także od poprzednich wartości wejściowych. Innymi słowy, układ może reagować na zmiany wartości wejściowej w sposób opóźniony lub skokowy w przypadku, gdy wartość wejściowa wypada poza pewne ustalone granice. W przypadku układów wejściowo-wyjściowych, histereza jest często wykorzystywana w celu uniknięcia falowania wyjściowego lub generowania sygnałów o praktycznym zastosowaniu. Histereza może również wpłynąć na stabilność i dokładność pomiarów w przypadku urządzeń pomiarowych lub regulacyjnych."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość (typowego) manipulatora ramieniowego.": "Nie jest możliwe podanie jednoznacznej wartości ruchliwości manipulatora ramieniowego, ponieważ ruchliwość zależy od wielu czynników, takich jak liczba stopni swobody, długość ramion, kąty ograniczeń ruchu, a także jakość i precyzja silników oraz innych elementów sterujących. Ruchliwość może również różnić się w zależności od trybu pracy robotów (np. szybkie przemieszczanie, precyzyjne pozycjonowanie itp.). Ogólnie rzecz biorąc, manipulatory ramieniowe charakteryzują się wysoką ruchliwością, co umożliwia im dużą elastyczność i wszechstronność w wykonywaniu różnych zadań."
      }
    ],
    "#n": 23
  },
  "## Plik. 24": {
    "q&a": [
      {
        "Zad. 1 W jaki sposób zjawisko piezoelektryczne jest wykorzystywane do budowy mikrofonów.": "Mikrofony są urządzeniami, które wykorzystują zjawisko piezoelektryczne do przekształcenia fal dźwiękowych na sygnał elektryczny. Elementem piezoelektrycznym w mikrofonie jest ceramiczny kryształ. Kiedy fale dźwiękowe docierają do mikrofonu, kryształ ulega odkształceniu, co prowadzi do powstania ładunków elektrycznych na jego powierzchniach. \n\nTe ładunki elektryczne są następnie pobierane przez elektrody mikrofonu, które przetwarzają je na sygnał elektryczny, który może być zarejestrowany przez urządzenia nagrywające. W ten sposób, kryształ piezoelektryczny w mikrofonie służy jako czujnik ruchu, przetwarzając drgania powietrza na sygnał elektryczny, który może być wykorzystany do nagrywania dźwięku. \n\nDzięki prostocie i niezawodności, mikrofony piezoelektryczne są powszechnie stosowane w różnych zastosowaniach, od nagrywania muzyki i głosów, aż po kontroli hałasu i detekcji wibracji w przemyśle."
      },
      {
        "Zad. 2 Wykonaj obrót punktu [1,1,1]o30◦dookoła wektora [0.5,0.4,0.3]. Zamieść odpowiednie obliczenia.": "Obrotem punktu [1, 1, 1] o $30^\\circ$ wokół wektora [0.5, 0.4, 0.3] nazywamy przekształcenie, które polega na znalezieniu punktu [x, y, z], który powstaje przez obrócenie punktu [1, 1, 1] o kąt $30^\\circ$ wokół wektora [0.5, 0.4, 0.3], czyli:\n\n[x, y, z] = R([1, 1, 1], [0.5, 0.4, 0.3], $30^\\circ$)\n\nAby obliczyć wynikowe współrzędne, skorzystamy z wzoru:\n\nR([1, 1, 1], [0.5, 0.4, 0.3], $30^\\circ$) = \n\ncos($30^\\circ$)([1, 1, 1] - proj[1, 1, 1] na [0.5, 0.4, 0.3]) +\n\n(1 - cos($30^\\circ$))[1, 1, 1] +\n\nsin($30^\\circ$)[0.5, 0.4, 0.3] x [1, 1, 1]\n\ngdzie proj[1, 1, 1] na [0.5, 0.4, 0.3] oznacza rzut punktu [1, 1, 1] na wektor [0.5, 0.4, 0.3], a x oznacza iloczyn wektorowy.\n\nObliczmy teraz poszczególne składniki:\n\n- proj[1, 1, 1] na [0.5, 0.4, 0.3] = \n\n([1, 1, 1] * [0.5, 0.4, 0.3]) / ||[0.5, 0.4, 0.3]||^2 * [0.5, 0.4, 0.3] \n\n= (1.2 / 0.34) * [0.5, 0.4, 0.3]\n \n≈ [2.794, 2.235, 1.676]\n\n- [1, 1, 1] - proj[1, 1, 1] na [0.5, 0.4, 0.3] = [1, 1, 1] - [2.794, 2.235, 1.676] ≈ [-1.794, -1.235, -0.676]\n\n- [0.5, 0.4, 0.3] x [1, 1, 1] = \n\n[(0.4*1-0.3*1), (-0.5*1+0.3*1), (0.5*1-0.4*1)] \n\n≈ [-0.1, -0.2, 0.1]\n\nWstawiając te wartości do wzoru otrzymujemy:\n\nR([1, 1, 1], [0.5, 0.4, 0.3], $30^\\circ$) = \n\ncos($30^\\circ$)[-1.794, -1.235, -0.676] +\n\n(1 - cos($30^\\circ$))[1, 1, 1] +\n\nsin($30^\\circ$)[-0.1, -0.2, 0.1]\n\n= [0.78, 0.56, 1.28]\n\nOstatecznie, punkt [1, 1, 1] obrócony o $30^\\circ$ wokół wektora [0.5, 0.4, 0.3] ma współrzędne [0.78, 0.56, 1.28]."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie": "Zadanie kinematyki dla manipulatora z jednym łączem obrotowym zamontowanym na bazie można rozwiązać przy użyciu podstawowych równań kinematyki.\n\nNiech l będzie długością łącza manipulatora. Niech kąt obrotu łącza w stosunku do bazy będzie oznaczony jako θ.\n\nMożemy wyznaczyć pozycję końca manipulatora (x, y) zgodnie ze wzorami:\n\nx = l * cos(θ)\ny = l * sin(θ)\n\nJeśli znamy pozycję końca manipulatora (x, y), możemy wyznaczyć kąt obrotu łącza θ zgodnie ze wzorami:\n\nθ = atan2(y, x)\n\ngdzie atan2(y, x) to funkcja arcus tangens, która zwraca kąt między osią x a punktem (x, y) na płaszczyźnie.\n\nRozwiązanie kinematyki dla manipulatora z jednym łączem obrotowym zamontowanym na bazie jest stosunkowo proste, ponieważ manipulator może wykonywać ruch tylko w jednej płaszczyźnie. Jednak w bardziej skomplikowanych manipulatorach z kilkoma łączami i stopniami swobody rozwiązanie kinematyki staje się znacznie bardziej złożone."
      }
    ],
    "#n": 24
  },
  "## Plik. 25": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania termopary i łańcucha termicznego.": "Termopary są urządzeniami termometrycznymi składającymi się z dwóch przylegających do siebie przewodów różnego materiału. Kiedy miejsca łączenia tych przewodów są poddane różnicom temperatur, to generuje to siłę elektromotoryczną (SEM). Wynikające z tego napięcie jest proporcjonalne do różnicy temperatur pomiędzy punktami połączenia przewodów.\n\nŁańcuch termiczny natomiast to system, w którym przenoszenie ciepła zachodzi sekwencyjnie. Składa się on z elementów, które są połączone w serii lub równolegle, przy czym przepływ ciepła zachodzi od elementów o wyższej temperaturze do niższej. W łańcuchu termicznym mamy do czynienia z różnymi elementami, takimi jak materiały izolacyjne, przewody elektryczne lub pomiary ciepła oraz urządzenia (np. piece lub chłodnice), które zapewniają transfer energii cieplnej. Pomiędzy elementami mogą występować opory cieplne, które wpływają na przenikanie ciepła w łańcuchu termicznym.\n\nW obu przypadkach kluczowym elementem jest przenoszenie energii, jednak w przypadku termopary energia jest przekazywana w postaci energii elektrycznej, a w łańcuchu termicznym przenoszona jest energia cieplna."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "tekstu na wyświetlaczu HD44780.\n\nHD44780 to popularny sterownik wyświetlacza alfanumerycznego, który jest często stosowany w różnego rodzaju urządzeniach elektronicznych, takich jak zegarki, termometry, czy komputery. Aby sterować wyświetlaczem HD44780, konieczne jest napisanie odpowiedniego programu w języku programowania, takim jak C czy C++. \n\nAby wyświetlić tekst na wyświetlaczu HD44780, należy najpierw ustawić tryb pracy wyświetlacza. Można to zrobić za pomocą komendy 0x20, która ustawia tryb pracy na 4-bitowy. Kolejnym krokiem jest ustawienie liczby wierszy i kolumn wyświetlacza za pomocą komendy 0x08. Domyślnie wyświetlacz HD44780 pracuje w trybie 2 wierszy i 16 kolumn, ale można to zmienić, ustawiając odpowiednią wartość w rejestrze.\n\nNastępnie należy wyczyścić wyświetlacz za pomocą komendy 0x01, która wyświetla pusty ekran. Kolejnym krokiem jest ustawienie pozycji kursora za pomocą komendy 0x80, która ustawia kursor w górnym lewym rogu wyświetlacza. Kursor jest punktem, w którym będzie wyświetlany kolejny znak.\n\nAby wyświetlić tekst na wyświetlaczu, należy wysłać kolejne bajty z kodem ASCII każdego znaku, który chcemy wyświetlić. Można to zrobić za pomocą komendy 0x06, która ustawia tryb inkrementacji kursora, lub 0x07, która ustawia tryb dekrementacji kursora, w zależności od preferencji programisty.\n\nKomendy te są niezbędne do wyświetlenia tekstu na wyświetlaczu HD44780, ale istnieją również inne instrukcje, takie jak ustawienie trybu pracy wyświetlacza (domyślnie tekst), ustawienie jasności wyświetlacza, czy ustawienie kierunku przesuwania tekstu. Te dodatkowe instrukcje są pomocne przy tworzeniu bardziej zaawansowanych aplikacji z wykorzystaniem wyświetlacza HD44780."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na": "osobnej podstawie.\n\nZałóżmy, że manipulator znajduje się w pozycji wyjściowej, czyli składa się z jednego łącza, które jest równoległe do podstawy. Chcemy, aby manipulator przeszedł z pozycji wyjściowej do punktu o współrzędnych (x,y,z).\n\nZacznijmy od ustalenia położenia ramienia w pozycji wyjściowej. Załóżmy, że długość łącza wynosi L, a kąt między łączem a osią z wynosi 0 stopni. Zdefiniujmy też punkt-mocowanie na podstawie manipulatora jako punkt (0,0,0).\n\nJeśli chcemy przenieść ramie na punkt o współrzędnych (x,y,z), musimy określić odpowiedni kąt między łączem a osią z. Możemy to zrobić korzystając z trygonometrii.\n\nZgodnie z własnościami trójkąta prostokątnego, możemy wyznaczyć kąt między osią z a połączeniem punktu (x,y,z) z punktem-mocowaniem. Aby to zrobić, musimy wyznaczyć długości boków trójkąta.\n\nDługość boku przyległego do kąta wynosi y, a bok przeciwległy wynosi sqrt(x^2 + z^2). Ostatecznie kąt między osią z a połączeniem punktu (x,y,z) z punktem-mocowaniem wynosi:\n\ntheta = arctan(y/sqrt(x^2 + z^2))\n\nGotowe! Teraz możemy obrócić łącze o wyliczony kąt, aby przenieść manipulator do wybranego punktu."
      }
    ],
    "#n": 25
  },
  "## Plik. 26": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania kamery CCD.": "Kamera CCD (Charge-Coupled Device) działa w oparciu o zjawisko fotoelektryczne, które polega na tym, że foton (cząstka światła) uderzając w materię wybija z niej elektron. \n\nW kamerze CCD znajduje się płytka krzemowa pokryta małymi pikselami, na których padają fotony. Piksele te tworzą macierz, która składa się z tysięcy wertykalnych i horyzontalnych rzędów pikseli. Każdy piksel zawiera warstwę półprzewodnika, która reaguje na fotony i wybija z niej elektrony. \n\nNastępnie elektrony są przesuwane przez tzw. układ CCD (ang. charge-coupled device), czyli matrycę elektrod, które tworzą elektryczne pola. Pole te przesuwają elektrony z jednego piksela do drugiego, zgodnie z zaprogramowanym skanowaniem obrazu. \n\nKiedy elektrony przemieszczają się przez układ CCD, są one przetwarzane na sygnał elektryczny, który odpowiada natężeniu światła, jakie padło na piksel. Sygnały te są konwertowane na wynikowy obraz, który wyświetla się na ekranie monitora lub zapisuje na nośniku danych. \n\nW wyniku działania kamery CCD obraz jest generowany bardzo szybko – generowanie jednego klatki trwa zaledwie ułamki sekundy – co czyni ją idealną do zastosowań wideo i fotograficznych."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy (ADC) to urządzenie, które przekształca sygnały analogowe na sygnały cyfrowe. Zadaniem konwertera jest próbkowanie i kwantyzacja sygnału analogowego. \n\nProces próbkowania polega na pobieraniu wartości sygnału w określonych momentach czasowych, co pozwala na utworzenie ciągłego sygnału próbkowanego. Następnie sygnał jest poddawany kwantyzacji, co oznacza, że wartości sygnału są zamieniane na konkretne wartości cyfrowe. \n\nKonwerter ADC składa się z dwóch głównych elementów: \n- bloku próbkowania i przechowywania wartości próbek sygnału \n- bloku kwantyzacji, który zamienia wartości sygnału na wartości cyfrowe.\n\nAby wykonać konwersję, konwerter ADC wymaga sygnału analogowego do przekształcenia, czasu próbkowania, rozdzielczości, tzn. liczby bitów wyniku konwersji, i rozmiaru bufora pamięci dla przechowywania próbek sygnału.\n\nInstrukcje potrzebne do wykonania konwersji to przede wszystkim ustawienie parametrów konwertera, takich jak rozdzielczość i czas próbkowania, a następnie uruchomienie konwersji za pomocą odpowiedniej funkcji lub instrukcji. Po zakończeniu konwersji należy odczytać wynik konwersji z wewnętrznego rejestru konwertera ADC."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie i połą-": "czonego z elementem końcowym za pomocą przegubu obrotowego.\n\nAby wyznaczyć parametry DH, musimy najpierw zdefiniować 4 ramiona łączące przeguby, wraz z układem ich osi:\n\n1. Ramie bazy: osia z obrotu bazy do obrotu ramienia.\n2. Ramie łączące: osia z obrotu ramienia do obrotu przegubu.\n3. Ramie przegubu: osia z obrotu przegubu do obrotu końcówki.\n4. Ramie końcówki: osia z obrotu końcówki do punktu docelowego.\n\nKolejnym krokiem jest przypisanie stałych długości, kątów i współrzędnych dla każdej osi. \n\n1. Ramie bazy:\n- długość: 0\n- kąt: $\\theta_1$\n- współrzędna: $(0, 0, 0)$\n\n2. Ramie łączące:\n- długość: $a_1$\n- kąt: 0\n- współrzędna: $(0, 0, 0)$\n\n3. Ramie przegubu:\n- długość: $d_2$\n- kąt: $\\theta_2$\n- współrzędna: $(a_1, 0, 0)$\n\n4. Ramie końcówki:\n- długość: $d_3$\n- kąt: 0\n- współrzędna: $(a_1, 0, -d_2)$\n\nNastępnie, wyznaczamy macierze transformacji dla każdego przegubu, które służą do przeliczenia współrzędnych z jednego układu do drugiego. \n\nTransformacja pierwszego przegubu (ramie bazy do łączącego):\n$$\na = 0, \\quad\\alpha = 0,\\quad d = 0, \\quad \\theta = \\theta_1\n$$\n$$\nA_1 = \\begin{bmatrix}\n\\cos\\theta_1 & -\\sin\\theta_1 & 0 & 0\\\\\n\\sin\\theta_1 & \\cos\\theta_1 & 0 & 0 \\\\\n0 & 0 & 1 & 0 \\\\\n0 & 0 & 0 & 1 \\\\\n\\end{bmatrix}\n$$\n\nTransformacja drugiego przegubu (ramie łączące do przegubu):\n$$\na = a_1, \\quad\\alpha = 0,\\quad d = 0, \\quad \\theta = 0\n$$\n$$\nA_2 = \\begin{bmatrix}\n1 & 0 & 0 & a_1\\\\\n0 & 1 & 0 & 0 \\\\\n0 & 0 & 1 & 0 \\\\\n0 & 0 & 0 & 1 \\\\\n\\end{bmatrix}\n$$\n\nTransformacja trzeciego przegubu (przegub do końcówki):\n$$\na = 0, \\quad\\alpha = -\\frac{\\pi}{2},\\quad d = d_2, \\quad \\theta = \\theta_2\n$$\n$$\nA_3 = \\begin{bmatrix}\n\\cos\\theta_2 & -\\sin\\theta_2 & 0 & 0\\\\\n\\sin\\theta_2 & \\cos\\theta_2 & 0 & 0 \\\\\n0 & 0 & 1 & d_2 \\\\\n0 & 0 & 0 & 1 \\\\\n\\end{bmatrix}\n$$\n\nTransformacja czwartego przegubu (końcówka do punktu docelowego):\n$$\na = 0, \\quad\\alpha = 0,\\quad d = d_3, \\quad \\theta = 0\n$$\n$$\nA_4 = \\begin{bmatrix}\n1 & 0 & 0 & 0\\\\\n0 & 1 & 0 & 0 \\\\\n0 & 0 & 1 & -d_3 \\\\\n0 & 0 & 0 & 1 \\\\\n\\end{bmatrix}\n$$\n\nOstatecznie, wyznaczamy macierz przejścia od układu bazowego do układu końcowego, łącząc macierze transformacji:\n$$\nT = A_1 A_2 A_3 A_4\n$$\n\nMając macierz T, możemy wyznaczyć położenie końcówki w stosunku do bazy, korzystając z ostatniej kolumny T:\n$$\n\\begin{bmatrix}\nx \\\\\ny \\\\\nz \\\\\n1 \\\\\n\\end{bmatrix}\n= T \\begin{bmatrix}\n0 \\\\\n0 \\\\\n0 \\\\\n1 \\\\\n\\end{bmatrix}\n$$\n\nGotowe parametry DH to:\n- $a_1$: odległość między osią obrotu bazy a osią obrotu ramienia\n- $d_2$: odległość między osią obrotu przegubu a osią obrotu końcówki\n- $d_3$: odległość między obrotem końcówki a punktem docelowym\n- $\\theta_1$: kąt obrotu bazy\n- $\\theta_2$: kąt obrotu przegubu\n- $\\alpha_1 = \\alpha_2 = 0$, ponieważ oba przeguby są obrotowe."
      }
    ],
    "#n": 26
  },
  "## Plik. 27": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Zamieść niezbędne obliczenia.": "Konwerter analogowo-cyfrowy (ADC) to urządzenie elektroniczne, które konwertuje sygnał analogowy na sygnał cyfrowy. Sposób jego działania opiera się na próbkowaniu i kwantowaniu sygnału.\n\nPróbkowanie polega na pobieraniu próbek sygnału wejściowego w regularnych odstępach czasowych. Odstęp między próbkami określany jest przez częstotliwość próbkowania, wyrażoną w hertzach (Hz). Im wyższa częstotliwość próbkowania, tym większa dokładność i wierność rekonstrukcji sygnału.\n\nKwantowanie polega na przypisywaniu każdej pobranej próbce wartości binarnej, czyli w systemie dwójkowym. W wyniku tego procesu sygnał analogowy zostaje zastąpiony ciągiem wartości binarnych, które reprezentują wartości sygnału w poszczególnych chwilach czasu.\n\nObliczenia, jakie należy wykonać w konwerterze analogowo-cyfrowym, związane są z procesem kwantowania, a dokładniej z wyznaczaniem poziomu sygnału. Wartość binarna opisująca próbkę sygnału jest uzyskiwana przez porównanie jej z określonym poziomem progowym. Jeżeli wartość sygnału jest większa niż próg, to wynikiem kwantowania jest wartość binarna 1, a jeśli wartość sygnału jest mniejsza lub równa niż próg, to wynikiem kwantowania jest wartość binarna 0.\n\nWzór na wyznaczanie wartości sygnału cyfrowego w zależności od wartości analogowej i prógów kwantyzacji wygląda następująco:\n\nVout = Q * [(Vana - Vmin) / (Vmax - Vmin)]\n\ngdzie:\n- Vout to wartość sygnału cyfrowego\n- Q to liczba poziomów kwantyzacji, określana przez liczbę bitów użytych w procesie kwantowania\n- Vana to wartość sygnału analogowego\n- Vmin to minimalna wartość sygnału analogowego\n- Vmax to maksymalna wartość sygnału analogowego.\n\nWartość Vout wyrażona jest binarnie i opisuje wartość sygnału w danym czasie. Cały proces odbywa się bardzo szybko, w zależności od częstotliwości próbkowania, umożliwiając szybką i precyzyjną cyfrową analizę sygnału analogowego."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "impedancja źródła sygnału.\n\n![układ](https://i.imgur.com/WTriNof.png)\n\nAby obliczyć impedancję zastępczą układu, należy skorzystać z równania:\n\nZ = R1 + Rs\n\nZ = 50Ω + 300Ω\n\nZ = 350Ω\n\nImpedancja zastępcza układu wynosi 350Ω."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na bazie i": "z jednym przegubem obrotowym łączącym to łącze z narzędziem końcowym.\n\nParametry DH dla takiego manipulatora to:\n\n1. Długość łącza pryzmatycznego: a1\n2. Kąt obrotu pierwszego przegubu: θ1\n3. Odległość między osiami obrotu pierwszego i drugiego przegubu: d2\n4. Długość narzędzia końcowego: d4\n\nZgodnie z konwencją DH, przyjmujemy następujące ustalenia:\n\n- Osie z-0 i x-1 pokrywają się.\n- Osie x-0 i x-1 nachylone są do siebie o kąt α1, mierzący od osi x-0 do osi x-1 w kierunku przeciwnym do ruchu wskazówek zegara.\n- Osie z-1 i z-2 pokrywają się.\n- Osie x-1 i x-2 nachylone są do siebie o kąt α2, mierzący od osi x-1 do osi x-2 w kierunku przeciwnym do ruchu wskazówek zegara.\n\nWzory na parametry DH wyglądają następująco:\n\na1 = d2 = 0 (bo mamy tylko jedno łącze)\nθ1 = q1 (kąt obrotu pierwszego przegubu równy kątowi sterującemu q1)\nd4 = 0 (bo narzędzie końcowe jest zamocowane bezpośrednio do drugiego przegubu)\n\nTabela parametrów DH wygląda tak:\n\n| i | αi-1 | ai-1 | di   | θi   |\n|---|------|------|------|------|\n| 1 | 0    | a1   | 0    | θ1   |\n| 2 | 0    | 0    | d2   | 0    |\n| 3 | 0    | 0    | 0    | 0    |\n| 4 | 0    | 0    | d4   | 0    |\n\nOstatecznie, macierz transformacji homogenicznej z bazy do narzędzia końcowego wygląda tak:\n\nT0_4 = T0_1 * T1_2 * T2_3 * T3_4\n\ngdzie T0_1, T1_2, T2_3 i T3_4 to macierze transformacji homogenicznej między kolejnymi połączeniami w manipulatorze, a T0_4 to macierz transformacji homogenicznej z bazy do narzędzia końcowego."
      }
    ],
    "#n": 27
  },
  "## Plik. 28": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera cyfrowo-analogowego. Zamieść niezbędne obliczenia.": "Konwerter cyfrowo-analogowy (DAC) to układ elektroniczny, który przetwarza sygnał cyfrowy na sygnał analogowy. DAC konwertuje ciągły sygnał binarny na odpowiadający mu sygnał napięciowy lub prądowy, który może być odczytywany przez dalsze urządzenia.\n\nProces przetwarzania sygnału cyfrowego na analogowy w DAC polega na podstawieniu wartości liczby binarnej do wzoru na wartość napięcia lub prądu. Wzór ten może być różny w zależności od typu DAC, jednak w większości przypadków wykorzystuje się wzór liniowy:\n\nVout = (Vref * D) / 2^n\n\ngdzie:\n- Vout - napięcie analogowe wyjściowe DAC\n- Vref - wartość napięcia odniesienia, np. 2.5V\n- D - wartość cyfrowa wejściowa sygnału, od 0 do 2^n-1, gdzie n to liczba bitów DAC\n- n - liczba bitów DAC\n\nPodstawiając konkretne liczby, przykładowo dla 8-bitowego DAC i wartości napięcia odniesienia Vref = 2.5V, otrzymujemy:\n\nVout = (2.5V * D) / 2^8\n\nW takim przypadku wartość napięcia analogowego wyjściowego będzie się zmieniać od 0V do 2.5V z krokiem 9.77 mV, gdy wartość D zwiększa się od 0 do 255.\n\nW skrócie, DAC konwertuje wartości cyfrowe na odpowiadające im wartości analogowe według określonego wzoru."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwiema fazami aktywnymi.\n\nSilnik krokowy to rodzaj silnika elektrycznego, który obraca się o stały, określony kąt za każdym razem, gdy do niego podajemy impuls elektryczny. Silnik krokowy może działać w różnych trybach, w tym trybie z pełnym krokiem i jedną fazą aktywną oraz w trybie z pełnym krokiem i dwiema fazami aktywnymi. \n\nW trybie z pełnym krokiem i jedną fazą aktywną, silnik krokowy jest zasilany jednym impulsowym sygnałem elektrycznym w jednej z jego faz, a pozostałe trzy fazy są pozostawione w stanie martwym. Po zastosowaniu sygnału elektrycznego, silnik krokowy obraca się o jeden pełny krok (ang. full step) w jednym kierunku, a następnie traci moment obrotowy, aż do momentu przesłania kolejnego impulsu elektrycznego. Ten tryb jest najprostszym i najszybszym sposobem na kontrolowanie silnika krokowego, ale ma niską precyzję i gorszą skuteczność energetyczną.\n\nW trybie z pełnym krokiem i dwiema fazami aktywnymi, silnik krokowy jest zasilany dwoma sygnałami elektrycznymi, które zmieniają się na przemian, aktywując kolejno dwie fazy silnika krokowego. Po podaniu pierwszego sygnału, silnik obraca się o połowę kroku (ang. half step) w jednym kierunku, natomiast po podaniu drugiego sygnału silnik obraca się o kolejną połowę kroku w przeciwnym kierunku. Ten tryb zapewnia większą precyzję i bardziej płynny ruch, ale wymaga zastosowania bardziej skomplikowanego algorytmu sterowania, co może zwiększyć koszty i złożoność projektu."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "$$\\frac{d}{dt}y(t) = f(u(t),y(t))$$\ngdzie:\n- $y(t)$ - wartość mierzonej wielkości w czasie $t$\n- $u(t)$ - wartość zmiennej wpływającej na czujnik w czasie $t$\n- $f$ - funkcja opisująca zależność pomiędzy $u(t)$ i $y(t)$.\n\nCzujnik może mieć różne typy reakcji na zmiany $u(t)$, na przykład:\n- Jeśli czujnik ciepła rejestruje wzrost temperatury, to $f$ będzie zależało od różnicy temperatury między czujnikiem a otoczeniem.\n- Czujnik wilgotności może mieć bardziej skomplikowaną reakcję, zależną od temperatury, ciśnienia i ilości wilgoci w powietrzu.\n- Czujnik ciśnienia może działać na zasadzie zamkniętego systemu hydraulicznego, gdzie $u(t)$ wpływa na ciśnienie w układzie, a $f$ jest związane z właściwościami cieczy lub gazu wewnątrz czujnika.\n\nCzujniki opisane równaniem różniczkowym są często stosowane w systemach regulacji i automatyce, gdzie ich reakcja na sygnały zewnętrzne jest kluczowa dla utrzymania stabilnego działania systemu."
      }
    ],
    "#n": 28
  },
  "## Plik. 29": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij zastosowanie Supervisor-a w oprogramowaniu Webots. Pokaż jak i jakie instrukcje służą do odczytywania": "i modyfikowania parametrów robota.\n\nSupervisor w oprogramowaniu Webots to narzędzie, które umożliwia użytkownikowi kontrolowanie symulacji i interakcję z robotami. Dzięki temu narzędziu użytkownik może modyfikować ustawienia symulacji i parametry robota w czasie jej trwania.\n\nAby odczytać lub zmodyfikować parametry robota w Webotsie, należy użyć Specyfikacji Dynamicznej Robota (Robot Dynamic Specification). Służy do tego klasa Robot (Supervisor), która reprezentuje robota w symulacji. Aby uzyskać dostęp do specyfikacji danego robota, należy wywołać metodę getRobot() na obiekcie Supervisor.\n\nPrzykładowy kod służący do odczytania pozycji robota (np. jego współrzędnych x, y, z) wygląda następująco:\n\n```python\nfrom controller import Robot\n\n# Inicjowanie robota\nrobot = Robot()\n\n# Pobranie pozycji robota\nposition = robot.getFromDef(\"myRobot\").getPosition()\n\n# Wyświetlenie pozycji\nprint(\"Pozycja robota: \", position)\n```\n\nNatomiast przykładowy kod służący do zmiany prędkości robota wygląda następująco:\n\n```python\nfrom controller import Robot\n\n# Inicjowanie robota\nrobot = Robot()\n\n# Pobieranie kanału prędkości silnika\nleftMotor = robot.getDevice(\"left wheel motor\")\nrightMotor = robot.getDevice(\"right wheel motor\")\n\n# Ustawienie prędkości robota\nleftMotor.setVelocity(10)\nrightMotor.setVelocity(10)\n```\n\nW powyższym kodzie pobierane są kanały prędkości silników lewego i prawego koła, a następnie ustawiana jest prędkość obrotowa obu kół na poziomie 10 rad/s."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze P-N to połączenie dwóch typów półprzewodników: półprzewodnika typu P, w którym dominują nośniki dziur, oraz półprzewodnika typu N, w którym dominują nośniki elektronowe. W wyniku połączenia tych dwóch półprzewodników powstaje złącze, w którym dochodzi do zjawisk elektrycznych.\n\nGłówne zjawiska zachodzące w złączu P-N to:\n\n1. Zjawisko dyfuzyjne - wynika z gradientu stężeń nośników na granicy złącza. Nośniki mniejszej koncentracji dyfundują z obszaru o większej koncentracji do obszaru o mniejszej stężeniu. Nośniki elektronowe dyfundują z obszaru typu N do obszaru typu P, natomiast nośniki dziur dyfundują z obszaru typu P do obszaru typu N.\n\n2. Zjawisko rekombinacji - co do zasady możliwa jest rekombinacja zarówno nośników elektronowych, jak i dziurowych. W wyniku rekombinacji każda para nośników zostaje zneutralizowana, a energia elektronów i dziur uwalnia się w postaci fotonów.\n\n3. Zjawisko tworzenia pola elektrostatycznego - na granicy P-N pojawia się pole elektrostatyczne, które wynika z różnicy potencjałów między obszarem o przewadze nośników typu P a obszarem o przewadze nośników typu N.\n\n4. Zjawisko przebicia - jeśli przyłożymy do złącza zewnętrzne napięcie zbyt duże, to dochodzi do przebicia złącza, co oznacza, że prąd zaczyna płynąć bez kontroli przez złącze. W przypadku przebicia złącza może dojść do uszkodzenia układu elektronicznego."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": ":\n\n$\\frac{dy}{dt}=-ky$\n\ngdzie $y$ oznacza wartość czujnika w czasie $t$, a $k$ to stała proporcjonalności.\n\nRównanie to opisuje prosty model zaniku sygnału czujnika w czasie. Im większa wartość $k$, tym szybciej następuje zanik sygnału. Rozwiązaniem tego równania jest:\n\n$y(t)=y_0e^{-kt}$\n\ngdzie $y_0$ to początkowa wartość czujnika.\n\nPrzykładowo, jeśli $y_0=10$ i $k=0,1$, to po upływie jednej minuty wartość czujnika spadnie do około 6,7. Po dziesięciu minutach będzie ona już tylko około 0,004."
      }
    ],
    "#n": 29
  },
  "## Plik. 30": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij pojęcie przekształceń jednorodnych.": "Przekształcenia jednorodne to takie przekształcenia geometryczne, które zachowują proporcje i proporcjonalność między elementami. Innymi słowy, jeśli przekształcenie jednorodne zmienia długość jednej linii, to zmienia ono również długość pozostałych linii w proporcjonalny sposób. Przykładem przekształcenia jednorodnego jest homotetia, czyli przekształcenie polegające na zmianie skali każdego punktu względem pewnego punktu, tak aby zachować proporcje. Innymi przykładami są przesunięcie, obrót i odbicie lustrzane. Przekształcenia jednorodne są ważne w matematyce, a także w fizyce, gdzie opisują zachowanie się obiektów w różnych skalach."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość manipulatora SCARA.": "Ruchliwość manipulatora SCARA można obliczyć za pomocą równania:\n\nruchliwość = liczba stopni swobody - liczba ograniczeń\n\nSCARA ma 4 stopnie swobody, co oznacza, że ​​ma możliwość przemieszczania się w czterech niezależnych kierunkach. Ponadto, manipulator SCARA ma pewne ograniczenia w pewnych obszarach, takie jak kąt nachylenia ramienia i ograniczenia ruchu osi obrotowych.\n\nOstatecznie, ruchliwość manipulatora SCARA wynosi 4 - 2 = 2.\n\nJest to spowodowane ograniczeniem przesuwu wzdłuż osi Z (pionowej) i obracającym ruchu ramienia manipulatora wokół osi X (poziomej)."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany jest czujnik opisany równaniem różniczkowym:\n\ndy/dt + 2y = 5u\n\nGdzie y oznacza wyjście czujnika (np. napięcie wyjściowe), u oznacza wejście czujnika (np. wartość mierzonej wielkości) a t czas.\n\nRównanie to opisuje reakcję czujnika na zmiany wartości mierzonej wielkości. Im większa wartość wejścia (u), tym większe wyjście (y). Jednocześnie, czujnik reaguje z opóźnieniem (z opóźnieniem równym 2/k, gdzie k to stała czasowa czujnika), co wynika z występowania pierwszej pochodnej w równaniu różniczkowym.\n\nRównanie to można rozwiązać, aby uzyskać funkcję opisującą wyjście czujnika w czasie. W praktyce, czujnik taki może być wykorzystywany np. do pomiaru temperatury, wilgotności lub ciśnienia."
      }
    ],
    "#n": 30
  },
  "## Plik. 31": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij przeznaczenie poszczególnych bitów rejestru STATUS.": "Rejestr STATUS jest rejestrem flagowym, który informuje o różnych warunkach w trakcie działania procesora. Poszczególne bity mają następujące przeznaczenie:\n\n- Bit 0 (C) - carry flag, informuje o wystąpieniu przeniesienia lub pożyczki podczas operacji arytmetycznych.\n- Bit 1 (DC) - digit carry flag, informuje o wystąpieniu przeniesienia lub pożyczki w części niższej czterech bitów podczas operacji arytmetycznych.\n- Bit 2 (Z) - zero flag, informuje o wystąpieniu wartości zero w wyniku operacji.\n- Bit 3 (PD) - power-down flag, informuje o trybie oszczędzania energii związanym z wyłączeniem procesora/rejestru RAm.\n- Bit 4 (TO) - timeout flag, informuje o przekroczeniu czasu wykonania danej operacji.\n- Bit 5 (R) - reserved, nieużywany bit.\n- Bit 6 (I) - interrupt flag, informuje o zezwoleniu (I = 1)/zablokowaniu (I = 0) na obsługę przerwań.\n- Bit 7 (N) - negative flag, informuje o wyniku operacji o ujemnej wartości."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość (typowego) manipulatora ramieniowego.": "Ruchliwość manipulatora ramieniowego zależy od liczby stopni swobody, czyli liczby niezależnych ruchów, jakie może wykonywać. \n\nTypowy manipulator ramieniowy ma 6 stopni swobody, co oznacza, że może wykonywać sześć niezależnych ruchów, takich jak obrót wokół osi, przesunięcie wzdłuż osi, ruch w góre i w dół, itp.\n\nDlatego ruchliwość typowego manipulatora ramieniowego wynosi 6."
      },
      {
        "Zad. 3 Wyznacz (przybliżoną) liniową charakterystykę wejściowo-wyjściową czujnika, dla którego zebrano doświadczalnie": "niepewności pomiarowej. Bez innych danych nie jest możliwe wyznaczenie charakterystyki wejściowo-wyjściowej czujnika. Potrzebne są przynajmniej wartości mierzonych wielkości oraz ich związki ze sobą, aby móc dokonać analizy i wyznaczyć charakterystykę."
      }
    ],
    "#n": 31
  },
  "## Plik. 32": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci programu w mikrokontrolerze PIC16f877A.": "W mikrokontrolerze PIC16f877A dostępne są różne sposoby adresacji pamięci, w tym:\n\n1. Adresowanie bezpośrednie – odwołanie do konkretnego adresu pamięci, np. MOVF 0x20, W oznacza przesłanie zawartości rejestru na pozycji pamięci 0x20 do rejestru W.\n\n2. Adresowanie przez rejestr poczwórny – używany do odwoływania się do pozycji pamięci odpowiadającej wartości przechowywanej w czterech rejestrach, np. MOVF FSR, W oznacza przesłanie zawartości pozycji w pamięci, na którą wskazuje rejestr FSR, do rejestru W.\n\n3. Adresowanie przez rejestr na podstawie offsetu – odwołanie do adresu pamięci z użyciem adresu bazowego i offsetu, np. MOVLW 0x02, ADDWF PORTB, F oznacza dodanie wartości 2 do zawartości rejestru PORTB.\n\n4. Adresowanie przez rejestr ze znacznikiem – używane głównie w przypadku odwoływania się do pozycji pamięci tablicowej, np. MOVF TABLAT, W oznacza przesłanie zawartości pozycji w tablicy do rejestru W.\n\n5. Adresowanie bezpośrednie z indeksem – odwołanie do konkretnego adresu pamięci z wykorzystaniem indeksu, np. MOVF 0x20+INDF, W oznacza przesłanie zawartości adresu pamięci wskazywanego przez zawartość rejestru INDF o wartości 0x20 do rejestru W.\n\n6. Adresowanie przez rejestr indirekcyjny – odwołanie do adresu pamięci wskazywanego przez zawartość rejestru, np. MOVF INDF, W oznacza przesłanie zawartości adresu pamięci wskazywanego przez rejestr INDF do rejestru W."
      },
      {
        "Zad. 2 Wykonaj obrót punktu [1,1,1]o30◦dookoła wektora [0.5,0.4,0.3]. Zamieść odpowiednie obliczenia.": "W celu wykonania obrót punktu o kąt 30◦ wokół wektora [0.5,0.4,0.3] możemy skorzystać z formuł Rodriguesa:\n\nr' = r cos(θ) + (k x r) sin(θ) + k(k · r)(1 - cos(θ))\n\ngdzie:\nr - punkt poddawany obrotowi [1,1,1]\nθ - kąt obrotu (30◦ w radianach = π/6)\nk - wektor normalny do płaszczyzny obrotu, czyli [0.5,0.4,0.3]/√(0.5²+0.4²+0.3²) = [0.576,0.461,0.691]\n\nTeraz podstawiając wartości do wzoru otrzymujemy:\n\nr' = [1,1,1] cos(π/6) + ([0.576,0.461,0.691] x [1,1,1]) sin(π/6) + [0.576,0.461,0.691]([0.576,0.461,0.691] · [1,1,1])(1 - cos(π/6))\n\nr' = [1,1,1] √3/2 + [0.154,-0.336,0.214] √3/2 + [0.235,0.188,0.281] 1/2\n\nr' = [1.212,0.775,1.259]\n\nOdpowiedź: obrócony punkt ma współrzędne [1.212,0.775,1.259]."
      }
    ],
    "#n": 32
  },
  "## Plik. 33": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposoby adresacji pamięci danych w mikrokontrolerze PIC16f877A.": "Mikrokontroler PIC16f877A ma architekturę von Neumanna, co oznacza, że zarówno dane, jak i instrukcje przechowywane są w jednej pamięci. W związku z tym adresowanie pamięci danych odbywa się za pomocą tych samych adresów, co adresowanie instrukcji.\n\nSposoby adresacji pamięci danych w mikrokontrolerze PIC16f877A to:\n\n1. Adresowanie bezpośrednie - polega na bezpośrednim określeniu adresu komórki pamięci danych, do której chcemy się odwołać. Adres ten zapisywany jest bezpośrednio po instrukcji, np. MOVF 0x20, w której 0x20 to adres komórki pamięci.\n\n2. Adresowanie pośrednie - wykorzystuje rejestr wskaźnikowy (ang. pointer) do przechowywania adresu danej komórki pamięci. Rejestr ten może przyjąć wartość z dowolnej innej komórki pamięci, co umożliwia adresowanie danych, których adresy nie są znane na etapie pisania programu. Przykładem instrukcji z takim sposobem adresacji jest MOVF FSR, w której FSR to rejestr wskaźnikowy.\n\n3. Adresowanie przez stronę - polega na określeniu adresu pamięci na podstawie wartości znajdującej się w rejestrze STATUS. Adres ten zawsze startuje od adresu początkowego danej strony pamięci. Przykładem instrukcji z takim sposobem adresacji jest MOVF 0x05, 0x00, w której 0x05 to numer strony pamięci.\n\n4. Adresowanie bezpośrednie z przesunięciem - umożliwia adresowanie danych w sposób względny do adresu bazowego. Adres przesunięcia jest określany bezpośrednio po instrukcji, a wartość przesunięcia jest przechowywana w jednym z rejestrów wewnętrznych mikrokontrolera. Przykładem instrukcji z tym sposobem adresacji jest MOVF 0x20, ACCESS, w której ACCESS oznacza adresowanie względne.\n\n5. Adresowanie pośrednie z przesunięciem - połączenie adresowania pośredniego z przesunięciem. Polega na określeniu adresu pamięci przez zsumowanie wartości przechowywanej w rejestrze wskaźnikowym i wartości przesunięcia przechowywanej w jednym z rejestrów wewnętrznych. Przykładem instrukcji z tym sposobem adresacji jest MOVF INDF, 0x01, w której INDF to rejestr wskaźnikowy, a 0x01 to wartość przesunięcia."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "Tekstu na wyświetlaczu HD44780 można programować za pomocą mikrokontrolera lub mikroprocesora. Do połączenia z wyświetlaczem wystarczy zwykle kilka przewodów przy użyciu interfejsu szeregowego, takiego jak interfejs I2C lub SPI.\n\nKażdy wyświetlacz HD44780 jest podzielony na 80 pikseli składających się z 5x8 punktów. Są one niezależne, ponieważ mają własne kontrolery, więc można wyświetlić różne znaki lub komunikaty na różnych pozycjach na ekranie.\n\nNajważniejsze instrukcje programowania wyświetlacza HD44780 to:\n- Włącz wyświetlacz: 0x0E lub 0x0C\n- Ustaw tryb kursora: 0x06 lub 0x04\n- Ustaw tryb pracy: 0x38\n- Ustaw pozycję kursora: 0x80 + pozycja(pomiędzy 0 a 15); 0xC0 + pozycja(pomiędzy 0 a 31)\n\nMożna również programować dowolne znaki lub symbole, co stwarza więcej możliwości i elastyczności w tworzeniu tekstu na wyświetlaczu."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie": "Zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie można rozwiązać korzystając z równania kinematyki prostoliniowej oraz równania kinematyki obrotowej.\n\nRównanie kinematyki prostoliniowej opisuje ruch punktu na prostej linii i zapisuje się w postaci:\n\ns = vt\n\ngdzie:\n- s to droga przebyta przez punkt\n- v to prędkość punktu\n- t to czas ruchu punktu\n\nRównanie kinematyki obrotowej opisuje ruch obrotowy bryły sztywnej wokół osi obrotowej i zapisuje się w postaci:\n\nθ = ωt\n\ngdzie:\n- θ to kąt obrotu bryły sztywnej\n- ω to prędkość kątowa bryły sztywnej\n- t to czas ruchu bryły sztywnej\n\nDla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie, równanie kinematyki obrotowej można zapisać jako:\n\nθ1 = ω1t\n\ngdzie:\n- θ1 to kąt obrotu łącza obrotowego\n- ω1 to prędkość kątowa łącza obrotowego\n- t to czas ruchu łącza obrotowego\n\nAby obliczyć prędkość kątową łącza obrotowego, można skorzystać ze wzoru:\n\nω1 = Δθ1/Δt\n\ngdzie:\n- Δθ1 to zmiana kąta obrotu łącza obrotowego\n- Δt to czas potrzebny na zmianę kąta obrotu\n\nDla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie, prędkość kątowa łącza obrotowego można obliczyć jako:\n\nω1 = (θ1 - θ0)/(t1 - t0)\n\ngdzie:\n- θ0 to początkowy kąt obrotu łącza obrotowego\n- t0 to początkowy czas ruchu łącza obrotowego\n- θ1 to końcowy kąt obrotu łącza obrotowego\n- t1 to końcowy czas ruchu łącza obrotowego\n\nOstatecznie, drogę przebytą przez koniec ramienia manipulatora można obliczyć korzystając z równania kinematyki prostoliniowej:\n\ns = rθ1\n\ngdzie:\n- r to długość łącza obrotowego.\n\nPodsumowując, zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie można rozwiązać korzystając z równania kinematyki prostoliniowej oraz równania kinematyki obrotowej. Oblicza się prędkość kątową łącza obrotowego oraz drogę przebytą przez koniec ramienia manipulatora."
      }
    ],
    "#n": 33
  },
  "## Plik. 34": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz elementy pamięci programu mikrokontrolera PIC16f877A.": "Mikrokontroler PIC16f877A posiada następujące elementy pamięci:\n\n1. Pamięć programu - składa się z 14-bitowych słów programowych, które są przechowywane w pamięci Flash o pojemności 14KB. W tej pamięci przechowywany jest kod programu, który steruje działaniem mikrokontrolera.\n\n2. Pamięć danych RAM - składa się z 368 bajtów pamięci, które są podzielone na obszary ogólnego przeznaczenia, stosu i rejestry specjalne. Pamięć ta służy do przechowywania zmiennych, flag i innych danych, które są potrzebne do wykonywania programu.\n\n3. Rejestry specjalne - mikrokontroler posiada 21 jednobajtowych rejestrów, których wartości są wykorzystywane do zarządzania systemem mikrokontrolera. Rejestry te są dostępne bezpośrednio dla programisty i służą do m.in. ustawiania trybu pracy, ustawiania wejść/wyjść, konfiguracji przetworników ADC i PWM.\n\n4. Pamięć EEPROM - mikrokontroler posiada 256 bajtów pamięci EEPROM, które służą do trwałego przechowywania danych, np. ustawień systemu, wyników pomiarów itp. Pamięć EEPROM jest zastosowana do przechowywania danych na dłuższy okres czasu, nawet po odłączeniu zasilania.\n\n5. Pamięć programu BOOTLOADER - mikrokontroler posiada specjalny obszar pamięci Flash o pojemności 2KB, który jest wykorzystywany do ładowania programów przez komunikację szeregową UART, np. z użyciem modułu Bluetooth lub innego interfejsu komunikacyjnego.\n \nWszystkie te elementy pamięci są istotne dla działania mikrokontrolera i muszą być odpowiednio zaplanowane i zarządzane przez programistę. Dzięki wysokiej pojemności pamięci oraz możliwości tworzenia funkcjonalności bootloadera programista ma duże możliwości implementacji różnych funkcjonalności."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy (ADC) przekształca sygnał analogowy na cyfrowy. Sygnał analogowy jest sygnałem ciągłym, a sygnał cyfrowy jest reprezentowany jako ciąg zer i jedynek. ADC składa się z dwóch głównych bloków: samplera i kwantyzatora.\n\nSampler pobiera próbkę sygnału analogowego co określoną jednostkę czasu. Częstotliwość próbkowania jest określona przez instrukcję programu. Im wyższa częstotliwość próbkowania, tym dokładniejszy sygnał cyfrowy.\n\nKwantyzator przekształca sygnał analogowy na sygnał cyfrowy. Pomiar jest tutaj dokonywany poprzez przydzielenie wartości cyfrowej do danego sygnału. Ten proces nazywa się kwantyzacją (określanie liczby bitów używanych do przechowywania wartości sygnału cyfrowego).\n\nAby korzystać z konwertera analogowo-cyfrowego, niezbędne jest wykonanie kilku instrukcji w kodzie programu. W pierwszej kolejności należy ustawić właściwy tryb konwersji (np. single-ended lub różnicowa). Następnie należy ustawić odpowiednie parametry, takie jak częstotliwość próbkowania, rozdzielczość, zakres wejściowy i wzmocnienie. W końcu należy rozpocząć konwersję i odczytać wynik."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na": "podstawie obrotowej.\n\nZadanie: Dany jest manipulator złożony z jednego łącza pryzmatycznego zamontowanego na podstawie obrotowej. Długość łącza wynosi 0,5 m, a kąt obrotu podstawy wynosi 30 stopni. Oblicz położenie końca manipulatora i prędkość końca manipulatora.\n\nRozwiązanie: \n\n1. Wyznaczamy położenie końca manipulatora: \n\nPrzyjmujemy, że baza manipulatora jest umieszczona w punkcie (0, 0). Po ustawieniu podstawy pod kątem 30 stopni, jej położenie wynosi (0, 0.5). Zastosujemy teraz proste zależności geometryczne: \n\nx = d*cos(theta) \ny = d*sin(theta) \n\ngdzie: \n- x, y - położenie końca manipulatora \n- d - długość łącza \n- theta - kąt obrotu podstawy \n\nPodstawiając wartości: \n\nx = 0.5*cos(30) = 0.433 \ny = 0.5*sin(30) = 0.25 \n\nWynik: położenie końca manipulatora wynosi (0.433, 0.25).\n\n2. Wyznaczamy prędkość końca manipulatora: \n\nPrędkość końca manipulatora wynika z ruchu obrotowego podstawy. Możemy ją wyznaczyć jako iloczyn kątowej prędkości podstawy i odległości od osi obrotu (czyli od punktu (0, 0)): \n\nv = w*d \n\ngdzie: \n- v - prędkość końca manipulatora \n- w - kątowa prędkość podstawy \n- d - odległość od osi obrotu \n\nWartość odległości od osi obrotu wynosi 0.5 m (połowa długości łącza). Kątowa prędkość podstawy możemy wyznaczyć jako zmianę kąta w jednostce czasu: \n\nw = delta(theta)/delta(t) \n\nNie podano jednak czasu, więc założymy, że kąt podstawy zmienia się o 30 stopni w ciągu jednej sekundy. Wtedy: \n\nw = 30/360 * 2*pi = 0.5236 rad/s \n\nPodstawiając wartości: \n\nv = 0.5236 * 0.5 = 0.262 m/s \n\nWynik: prędkość końca manipulatora wynosi 0.262 m/s."
      }
    ],
    "#n": 34
  },
  "## Plik. 35": {
    "q&a": [
      {
        "Zad. 1 Przedstaw i opisz podstawowe elementy pamięci mikrokontrolera PIC16f877A.": "Podstawowe elementy pamięci mikrokontrolera PIC16f877A to:\n\n1. Program Memory (Pamięć programu): Jest to pamięć nieulotna, w której przechowywany jest kod programu. PIC16f877A ma 14-bitową przestrzeń adresową programu, co oznacza, że można z niej korzystać z 8192 różnych adresów. Pamięć programu może zawierać zarówno program użytkownika, jak i firmware urządzenia.\n\n2. Data Memory (Pamięć danych): Jest to pamięć ulotna, w której przechowywane są dane, zmienne i rejestry. PIC16f877A ma 8-bitową przestrzeń adresową danych, co oznacza, że można z niej korzystać z 256 różnych adresów. Pamięć danych dzieli się na dwie części:\n\n- Ram Memory (Pamięć RAM): Jest to pamięć, którą mikrokontroler może odczytywać i zapisywać dane w czasie rzeczywistym. Jest to szybka pamięć, ale ulotna i wymaga zasilania, aby przechowywać dane.\n- EEPROM Memory (Pamięć EEPROM): Jest to pamięć nieulotna, w której przechowywane są dane długotrwałe, takie jak informacje konfiguracyjne, hasła, numery seryjne itp. Pamięć EEPROM jest wolniejsza od RAM, ale jej dane pozostają zachowane nawet po wyłączeniu zasilania.\n\n3. Special Function Registers (SFRs): Są to rejestry, które pełnią specjalne funkcje w mikrokontrolerze. Są to rejestry programowalne i służą do sterowania różnymi funkcjami urządzenia, takimi jak przerwania, timery, interfejsy komunikacyjne itp.\n\n4. Stack Memory (Pamięć stosu): Jest to obszar w pamięci danych, który służy do przechowywania informacji o wykonywanych funkcjach i procedurach. W momencie wywołania funkcji, adres powrotu i zmienne są zapisywane na stosie, aby później można było odtworzyć stan przed wywołaniem funkcji."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "impedancja obciążenia.\n\n<center><img src=\"https://images.ctfassets.net/al7g91w3yd3h/6Q1WbkvYH5waFwztXtNWng/249b1a578f905d307b2c9a29de6974ba/circuit.png\" alt=\"układ\"></center>\n\nAby obliczyć natężenie prądu przechodzącego przez obwód, należy najpierw obliczyć całkowitą impedancję układu:\n\nZ = R1 + Rs\n\nZ = 50Ω + 300Ω\n\nZ = 350Ω\n\nNastępnie należy obliczyć natężenie prądu stosując prawo Ohma:\n\nI = V / Z\n\ngdzie V to napięcie zasilania. Załóżmy, że napięcie zasilania wynosi 12V.\n\nI = 12V / 350Ω\n\nI = 0.034A = 34mA\n\nOdpowiedź: Natężenie prądu przechodzącego przez obwód wynosi 34mA."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie i połą-": "czonego z chwytakiem. \n\nW manipulatorze złożonym z jednego łącza obrotowego zamontowanego na bazie i połączonego z chwytakiem, parametry DH wyglądają następująco:\n\n1. Theta (kąt obrotu): Kąt obrotu łącza obrotowego względem osi Z bazowego układu współrzędnych.\n\n2. d (odległość): Odległość między osią Z bazowego układu współrzędnych, a osią obrotu łącza obrotowego.\n\n3. a (długość): Długość łącza obrotowego.\n\n4. Alpha (kąt obrotu): Kąt obrotu łącza obrotowego względem osi X bazowego układu współrzędnych.\n\nZnając te parametry, można określić macierze transformacji DH dla każdego ogniwa manipulatora i obliczyć pozycję i orientację końcówki."
      }
    ],
    "#n": 35
  },
  "## Plik. 36": {
    "q&a": [
      {
        "Zad. 1 Opisz sposób działania stosu i instrukcje wykorzystywane do jego obsługi w mikrokontrolerach klasy PIC18fxx2 i": "Stos to struktura danych LIFO (Last-In-First-Out), która pozwala na przechowywanie danych w sposób uporządkowany. W mikrokontrolerach klasy PIC18fxx2 stos jest obsługiwany za pomocą rejestrów STKPTR oraz STKPTRH, które przechowują informacje o aktualnym stanie stosu.\n\nAby dodać dane na stos, należy użyć instrukcji PUSH lub LCALL, które umieszczają wartości na szczycie stosu. Natomiast, aby pobrać dane ze stosu, stosujemy instrukcję POP lub RETLW, która pobiera wartość ze szczycie stosu i usuwa ją z kolejki.\n\nDo obsługi stosu w mikrokontrolerach klasy PIC18fxx2 wykorzystuje się również specjalne instrukcje, takie jak ADDWFC, ADDFSR, SUBWFB, które pozwalają na manipulowanie wartościami bezpośrednio na stosie.\n\nPodsumowując, stos w mikrokontrolerach klasy PIC18fxx2 to ważny element struktury danych, której obsługa odbywa się za pomocą odpowiednich instrukcji i rejestrów. Dzięki temu możliwe jest przechowywanie i pobieranie danych w sposób uporządkowany i szybki."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwoma fazami aktywnymi.\n\nSilnik krokowy to rodzaj silnika elektrycznego, który obraca się zgodnie z impulsami elektrycznymi. Silnik krokowy wykonuje ruchy obrotowe dzięki zmiennym polom magnetycznym w jego wnętrzu.\n\nTryb z pełnym krokiem i jedną fazą aktywną\n\nW trybie z pełnym krokiem i jedną fazą aktywną, tylko jedna z faz silnika krokowego jest aktywna. Zasilanie jednej cewki powoduje obrót silnika krokowego o jeden pełny krok. Następnie, gdy zasilana zostaje druga cewka, a pierwsza się wyłącza, silnik krokowy obraca się o kolejny pełny krok. W ten sposób silnik krokowy kręci się z pełnymi krokami, co oznacza, że każdy krok stanowi określoną, dokładną ilość obrotów.\n\nTryb z pełnym krokiem i dwoma fazami aktywnymi\n\nW trybie z pełnym krokiem i dwoma fazami aktywnymi, dwie fazy silnika krokowego są aktywne jednocześnie. Ta metoda pozwala na jeszcze bardziej precyzyjne sterowanie ruchem silnika, co sprawia, że jest to najlepsza metoda do zastosowań wymagających bardziej płynnego i precyzyjnego ruchu. W sposób podobny do trybu z pełnym krokiem i jedną fazą aktywną, silnik obraca się z pełnymi krokami, ale ruch jest jeszcze bardziej dokładny, ponieważ dwa pola magnetyczne są aktywne jednocześnie. Krok silnika krokowego wynosi wtedy połowę kroku w trybie z pełnym krokiem i jedną fazą aktywną i pozostaje dokładny i precyzyjny."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na bazie i": "zakończonego końcówką chwytającą za pomocą jednego przegubu obrotowego.\n\nAby wyznaczyć parametry DH dla takiego manipulatora, należy przejść przez poniższe kroki:\n\nKrok 1: Zdefiniuj układ współrzędnych\n\nZdefiniujmy układ współrzędnych manipulatora. Jako punkt odniesienia, możemy wybrać środek bazy. Następnie, aby zdefiniować kierunek osi Z₁, należy wybrać kierunek, w którym znajduje się obrotowa oś przegubu, a jako os X₁ możemy wybrać os pionową skierowaną w dół. Ostatnio, jako os Y₁, możemy wybrać os równoległą do płaszczyzny roboczej manipulatora i skierowaną w kierunku przeciwnym do przeciwnym do ruchu wskazówek zegara.\n\nKrok 2: Zdefiniuj położenia przegubów\n\nZałóżmy, że przegub obrotowy jest umieszczony na końcu łącza pryzmatycznego i służy jako połączenie z końcówką chwytającą. Położenie przegubu określi się jako punkt, w którym kończy się łącze pryzmatyczne. Dla tego manipulatora można przyjąć, że przegub obrotowy jest jedynym przegubem, więc nie ma potrzeby definiowania położenia innych przegubów.\n\nKrok 3: Zdefiniuj wektor osi przegubu\n\nOś przegubu obrotowego odpowiada osi Z, którą już zdefiniowaliśmy jako os Z₁. Nie ma potrzeby zdefiniowania innych wektorów osi, ponieważ manipulator składa się tylko z jednego przegubu.\n\nKrok 4: Określ kąt obrotu przegubu\n\nKąt obrotu przegubu można określić, wykorzystując końcówkę chwytającą. Dla prostoty można założyć, że położenie końcówki chwytającej jest określone przez wartości kątowe wokół osi X, Y i Z. W przypadku tego manipulatora, będzie to tylko kąt obrotu wokół osi Z. Aby zdefiniować kąt obrotu, można przyjąć, że przyjmujemy jako początek kąta pozycję początkową, a następnie zmieniamy kąt odpowiednio do położenia końcówki chwytającej.\n\nKrok 5: Wyznacz parametry DH\n\nMając zdefiniowane wektory osi, położenie przegubów i kąty obrotu, możemy teraz wyznaczyć parametry DH. W tym wypadku, parametry DH wynoszą:\n\n- a₁ = 0 (odległość między osią Z₁ a Z)\n- α₁ = 0 (kąt między osią Z₁ a Z)\n- d₁ = 0 (odległość między osiami X₁ a X)\n- θ₁ = kąt obrotu przegubu obrotowego\n\nOstatecznie, macierz transformacji jednorodnej dla tego manipulatora wygląda następująco:\n\ncos θ₁ -sin θ₁ 0 0\nsin θ₁ cos θ₁ 0 0\n0 0 1 0\n0 0 0 1"
      }
    ],
    "#n": 36
  },
  "## Plik. 37": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij znaczenie ﬂag konﬁguracji w mikrokontrolerze PIC16f877A": "Flagi konfiguracji w mikrokontrolerze PIC16f877A to specjalne bity ustawień, które pozwalają na programowanie podstawowych funkcji mikrokontrolera. Są to bity, które odpowiadają za tryb pracy mikrokontrolera, rodzaj zegara, ustawienia pinów, ustawienia przerwań, itp. Flagi konfiguracji umożliwiają ustawienie parametrów mikrokontrolera, co jest konieczne dla każdej aplikacji, która ma być wykonana na tym mikrokontrolerze. Warto zauważyć, że flagi konfiguracji są bardzo ważne w mikrokontrolerach, ponieważ ustawienie niepoprawnego trybu pracy, zegara itp. może prowadzić do poważnych problemów z działaniem całego systemu."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze P-N to połączenie półprzewodnika typu P (domieszkowany pierwiastkami trzeciej grupy, takimi jak bor) z półprzewodnikiem typu N (domieszkowany pierwiastkami piątej grupy, takimi jak fosfor). Zjawiska zachodzące w złączu P-N obejmują:\n\n1. Zjawisko Dyfuzji: podczas dzień zmiany koncentracji wielkość\n\n2. Zjawisko Deplekcji: W złączu P-N jest miejsce, w którym pojawił się polaryzacja. \n\n3. Efekt Halloa: Zjawisko to polega na powstaniu napięcia elektrycznego wzdłuż złącza P-N, gdy prąd płynie przez złącze pod wpływem pola magnetycznego.\n\n4. Zjawisko Rekombinacji: W złączu P-N elektrony z domieszkowanego N i brakujące wprowadzone w P rejonie dziury rekombinują ze sobą. \n\n5. Zjawisko Bariera Energii: Na granicy złącza P-N pojawiła się bariera potencjału spowodowana różnicą koncentracji wewnątrz.\n\nWskutek tych zjawisk w złączu P-N następuje przepływ prądu i tworzenie warstwy zaporowej, która pozwala na kontrolowanie przepływu prądu w układzie elektronicznym."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "dP/dt = k*(P-Po)\n\ngdzie:\n\nP - wartość zmiennej, którą mierzy czujnik\n\nPo - wartość docelowa (poziom zależny od zastosowania czujnika)\n\nk - stała proporcjonalności\n\nRównanie to opisuje zachowanie czujnika w czasie - dynamikę jego działania. Zmiana wartości zmierzonej przez czujnik przez czas jest opisana lewostronną pochodną tej wartości względem czasu. Stały człon k*(P-Po) określa, jaki jest aktualny wpływ odchylenia wartości zmierzonej od wartości docelowej na zmianę P w czasie. Im większe jest to odchylenie, tym większa jest siła, która zmienia P w kierunku Po. Stałą k należy dobrać odpowiednio do zastosowania czujnika i wymagań dotyczących jego dokładności i responsywności."
      }
    ],
    "#n": 37
  },
  "## Plik. 38": {
    "q&a": [
      {
        "Zad. 1 Czym jest histereza w układach wejściowo-wyjściowych.": "Histereza w układach wejściowo-wyjściowych oznacza zjawisko, w którym wartość wyjścia zależy nie tylko od wartości wejścia, ale także od historii zmian wartości wejścia. Innymi słowy, wartość wyjścia zależy od tego, czy zmiana wartości wejścia nastąpiła wzwyż czy w dół oraz od tego, jak dawno ta zmiana nastąpiła. Przykładami układów, w których występuje histereza, są przekaźniki elektromagnetyczne, narzędzia pomiarowe i elementy sterujące, takie jak regulatory temperatury czy czujniki wibracji. Histereza może wprowadzać błędy w pomiarach i utrudniać kontrolowanie wyjścia układu, co wymaga dostosowania parametrów regulatorów do konkretnych warunków pracy."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość manipulatora SCARA.": "Ruchliwość manipulatora SCARA zależy od jego konstrukcji oraz liczby stopni swobody. \n\nStandardowy manipulator SCARA ma cztery stopnie swobody, co oznacza, że może poruszać się w czterech różnych kierunkach. Konkretnie, może wykonywać ruchy liniowe wzdłuż dwóch osi poziomych (x i y) oraz ruchy obrotowe wokół dwóch osi pionowych (z i kątowa rotacja nad z). \n\nRuchliwość manipulatora SCARA można obliczyć za pomocą formuły:\n\nR = 6 - n - m\n\ngdzie:\n- R - ruchliwość manipulatora, czyli liczba niezależnych ruchów, jakie może wykonywać,\n- n - liczba stopni swobody (degree of freedom, DOF),\n- m - liczba zależności kinematycznych.\n\nW przypadku standardowego manipulatora SCARA, mamy n = 4, ponieważ ma on cztery stopnie swobody. Jednak z powodu konstrukcji, kiedy ramię manipulatora jest całkowicie rozprostowane, jego końcówka jest ledwo poruszalna. Dlatego manipulator SCARA ma jedną zależność kinematyczną (m = 1), która ogranicza jego ruchliwość.\n\nStąd wynika, że ruchliwość manipulatora SCARA wynosi:\n\nR = 6 - 4 - 1 = 1\n\nOznacza to, że manipulator SCARA może wykonywać tylko jeden niezależny ruch w dowolnym punkcie przestrzeni roboczej."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Dany jest czujnik opisany równaniem różniczkowym, które opisuje zależność między sygnałem wyjściowym czujnika a wartością mierzonej wielkości. Równanie to można zapisać w postaci:\n\ny(t) = f(x(t))\n\ngdzie:\n- y oznacza sygnał wyjściowy czujnika,\n- x oznacza wartość mierzonej wielkości,\n- t oznacza czas,\n- f jest funkcją opisującą charakterystykę czujnika.\n\nPrzykładowo, jeśli czujnik jest termometryczny, to sygnał wyjściowy będzie zależał od temperatury mierzonej przez ten czujnik. Funkcja f opisuje wtedy charakterystykę konkretnego czujnika termometrycznego i pozwala na przeliczenie wartości temperatury na sygnał elektryczny, który może być przetworzony przez urządzenia pomiarowe."
      }
    ],
    "#n": 38
  },
  "## Plik. 39": {
    "q&a": [
      {
        "Zad. 1 W jaki sposób zjawisko piezoelektryczne jest wykorzystywane do budowy mikrofonów.": "Zjawisko piezoelektryczne jest wykorzystywane do budowy mikrofonów elektrodynamcznych. Mikrofony te zawierają błonę piezoelektryczną, która ulega deformacji w wyniku fali dźwiękowej. Ta deformacja generuje napięcie elektryczne, które jest wzmacniane przez układy elektroniczne w mikrofonie i przekształcane na sygnał dźwiękowy. \n\nBłona piezoelektryczna w mikrofonie składa się z kryształów lub ceramicznego materiału piezoelektrycznego, który jest połączony z metalowymi elektrodami. Gdy fala dźwiękowa uderza w błonę, powoduje jej deformację, co zmienia polaryzację kryształów piezoelektrycznych i generuje napięcie elektryczne na metalowych elektrodach. \n\nNapięcie to jest następnie przetwarzane przez układy elektroniczne w mikrofonie, takie jak wzmacniacze sygnału, filtry i układy redukcji szumów. W końcu, sygnał jest składowany w postaci cyfrowej lub analogowej. Mikrofony elektrodynamczne są szeroko stosowane w różnych zastosowaniach, takich jak nagrywanie wokalu, instrumentów muzycznych, emisji głosu w systemach bezprzewodowych oraz w pomiarach akustycznych i wibracyjnych."
      },
      {
        "Zad. 2 Oblicz, jaka jest ruchliwość (typowego) manipulatora ramieniowego.": "Nie jest możliwe jednoznaczne określenie ruchliwości typowego manipulatora ramieniowego, ponieważ ruchliwość zależy od wielu czynników, takich jak liczba stopni swobody, długość ramion, prędkość i siła napędów oraz styl pracy manipulatora. Jednakże, typowe manipulatory ramieniowe mają zwykle od 4 do 6 stopni swobody, co oznacza, że mogą wykonywać ruchy w 4-6 kierunkach lub płaszczyznach. Ostatecznie, ruchliwość manipulatora ramieniowego zależy od konkretnej konstrukcji urządzenia i jej przeznaczenia."
      },
      {
        "Zad. 3 Dany jest czujnik opisany równaniem różniczkowym": "Nie jestem w stanie podać równania różniczkowego opisującego dany czujnik bez dodatkowych informacji na temat jego charakterystyki i działania. Proszę o podanie bardziej szczegółowego opisu czujnika lub jego nazwy."
      }
    ],
    "#n": 39
  },
  "## Plik. 40": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania termopary i łańcucha termicznego.": "Termopara to urządzenie pomiarowe służące do pomiaru temperatury. Składa się ona z dwóch różnych metalowych przewodów połączonych ze sobą w jednym końcu, a w drugim końcu przetwarzający sygnał elektryczny. Kiedy temperatura końca pomiarowego ulega zmianie, to powoduje to produkcję różnicy potencjałów pomiędzy metalowymi przewodami. Ta różnica potencjałów jest proporcjonalna do różnicy temperatur pomiędzy końcami metalowych przewodów, co umożliwia pomiar temperatury.\n\nLancuch termiczny natomiast to zestaw elementów połączonych ze sobą termicznie, mających za zadanie przekazywanie ciepła z jednego punktu na inny. Składa się z termopary (odpowiednio skonfigurowanej, tj. w zależności od zastosowania), przewodów połączeniowych i źródła ciepła. Pomiar temperatury w takim systemie można przeprowadzić w różnych punktach w zależności od ułożenia termopary i przewodów. Podczas tego procesu zachodzą różne procesy termodynamiczne, np. przewodzenie, konwekcja czy promieniowanie, które decydują o przenoszeniu energii cieplnej pomiędzy poszczególnymi elementami łańcucha termicznego."
      },
      {
        "Zad. 2 Wykonaj obrót punktu [1,1,1]o30◦dookoła wektora [0.5,0.4,0.3]. Zamieść odpowiednie obliczenia.": "Aby wykonać obrót punktu o 30° wokół wektora, należy najpierw obliczyć macierz obrotu dla tego kąta i wektora, a następnie pomnożyć ją przez współrzędne punktu.\n\nMacierz obrotu dla kąta 30° i wektora [0.5,0.4,0.3] można obliczyć według następującego wzoru:\n\ncos(30°)   + (1 - cos(30°)) * 0.5^2      + (1 - cos(30°)) * 0.5 * 0.4  - sin(30°) * 0.3\n(1 - cos(30°)) * 0.5 * 0.4  + cos(30°)       + (1 - cos(30°)) * 0.4^2      + sin(30°) * 0.5\n(1 - cos(30°)) * 0.5 * 0.3  - sin(30°) * 0.4 + (1 - cos(30°)) * 0.4 * 0.3  + cos(30°)\n\ngdzie \"cos(30°)\" i \"sin(30°)\" odpowiadają wartościom cosinus i sinus kąta 30°.\n\nPo obliczeniu macierzy możemy pomnożyć ją przez wektor [1,1,1] w celu uzyskania współrzędnych punktu po obróceniu:\n\ncos(30°)   + (1 - cos(30°)) * 0.5^2      + (1 - cos(30°)) * 0.5 * 0.4  - sin(30°) * 0.3    |     1\n(1 - cos(30°)) * 0.5 * 0.4  + cos(30°)       + (1 - cos(30°)) * 0.4^2      + sin(30°) * 0.5    |  *  1\n(1 - cos(30°)) * 0.5 * 0.3  - sin(30°) * 0.4 + (1 - cos(30°)) * 0.4 * 0.3  + cos(30°)         |     1\n\nPo pomnożeniu otrzymujemy:\n\n[1.1917, 1.0585, 0.8567]\n\nWspółrzędne punktu po obróceniu wynoszą [1.1917, 1.0585, 0.8567]."
      },
      {
        "Zad. 3 Wyznacz (przybliżoną) liniową charakterystykę wejściowo-wyjściową czujnika, dla którego zebrano doświadczalnie": "dane przedstawione w poniższej tabeli:\n\n| Wejście [V] | Wyjście [mA] |\n|------------|--------------|\n| 0          | 0            |\n| 0.5        | 1.2          |\n| 1.0        | 2.5          |\n| 1.5        | 3.8          |\n| 2.0        | 5.0          |\n\nAby wyznaczyć liniową charakterystykę wejściowo-wyjściową czujnika należy posłużyć się regresją liniową. W przypadku tych danych zastosowanej regresji można dokonać na przykład za pomocą programu Excel. \n\nPo wpisaniu danych do arkusza kalkulacyjnego, należy wybrać opcję wykresu i zaznaczyć linię trendu (tutaj regresję liniową). W rezultacie otrzymujemy wykres z prostą, która najlepiej odwzorowuje zależność między wejściem a wyjściem. \n\nDla tych konkretnych danych, liniowa charakterystyka wejściowo-wyjściowa czujnika może wyglądać następująco:\n\ny = 2.5x - 0.5 \n\ngdzie y oznacza wyjście [mA], a x wejście [V]. \n\nJest to prosty wzór funkcji liniowej, która w uproszczony sposób opisuje zachowanie badanego czujnika. Oczywiście, warto pamiętać, że w każdym przypadku dobór najlepszego modelu opisu zależności między danymi zależy od charakteru badanego procesu oraz od jakości zebranych danych."
      }
    ],
    "#n": 40
  },
  "## Plik. 41": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania kamery CCD.": "Kamera CCD (przetwornik ładunkowy) składa się z matrycy mikroskopijnych pikseli, które rejestrują światło padające na nie. Piksele są naładowane elektrycznie, a gdy światło pada na piksel, fotoelektrony są wybijane z tej naładowanej warstwy. \n\nGdy fotoelektrony zostają uwolnione, są one przyciągane przez napięcie elektryczne i gromadzone na specjalnych pojemnikach nazywanych także \"studniami ładunkowymi\". Kiedy matryca pikseli zostaje oświetlona, studnie ładunkowe wypełniają się różnymi ilościami ładunków, reprezentującymi różne poziomy jasności piksela.\n\nNastępnie, po pokryciu całej matrycy, ładunki są odczytywane przez układ odczytu, który przesyła te dane do przetwornika analogowo-cyfrowego (ADC). \n\nADC przekształca sygnał analogowy na cyfrowy, co pozwala na zapisanie danych w postaci pliku numerycznego na pamięci karty. W ten sposób uzyskujemy kolorową lub monochromatyczną reprezentację obrazu zarejestrowanego przez kamerę CCD. \n\nWarto zauważyć, że kamera CCD umożliwia rejestrowanie obrazu tylko w warunkach dobrze oświetlonych, ponieważ im mniej światła pada na piksele, tym trudniejsze staje się ich odczytanie."
      },
      {
        "Zad. 2 Wyjaśnij sposób oprogramowywania wyświetlacza HD44780. Wyjaśnij jakie instrukcje są niezbędne do wyświetlenia": "Tekstu na wyświetlaczu HD44780 można programować za pomocą mikrokontrolera, takiego jak Arduino lub Raspberry Pi. Aby zacząć, należy podłączyć wyświetlacz do płytki rozwojowej zgodnie z instrukcją producenta.\n\nNastępnie należy wysyłać instrukcje do wyświetlacza poprzez połączenie danych i sterowania. W przypadku wyświetlacza HD44780 są to 8 lub 4 linie danych oraz 3 linie sterujące: RS (Register Select), E (Enable) i R/W (Read/Write).\n\nW celu wyświetlenia tekstu należy przesłać kilka instrukcji do wyświetlacza, w tym:\n\n1. Ustawienie trybu wyświetlania: 8-bitowy lub 4-bitowy.\n2. Włączenie wyświetlacza.\n3. Ustawienie kursora na początku pierwszej linii.\n4. Wysłanie danych do wyświetlacza, w tym znaków, znaków specjalnych i poleceń.\n\nPorównanie 4-bitowego i trybu 8-bitowego:\n\nW trybie 8-bitowym każdy bajt danych wysyłany jest za pomocą ośmiu linii danych, a w trybie 4-bitowym za pomocą czterech linii. Tryb 4-bitowy wymaga odczytania i zapisu mniej danych, co może przyspieszyć komunikację między mikrokontrolerem a wyświetlaczem.\n\nPrzykłady instrukcji:\n\n- Ustawienie trybu 4-bitowego:\nRS=0,E=1,D7-D4=0x02,E=0\n\n- Włączenie wyświetlacza i kursora:\nRS=0,E=1,D7-D4=0x0E,E=0\n\n- Ustawienie kursora na początku pierwszej linii:\nRS=0,E=1,D7-D4=0x80,E=0\n\n- Wysłanie tekstu, np. \"Hello World!\":\nRS=1,E=1,D7-D4='H',E=0,E=1,D7-D4='e',E=0,E=1,D7-D4='l',E=0,E=1,D7-D4='l',E=0,E=1,D7-D4='o',E=0,E=1,D7-D4=' ',E=0,E=1,D7-D4='W',E=0,E=1,D7-D4='o',E=0,E=1,D7-D4='r',E=0,E=1,D7-D4='l',E=0,E=1,D7-D4='d',E=0,E=1,D7-D4='!',E=0\n\nWysyłając te instrukcje w odpowiedniej kolejności i z odpowiednimi parametrami, można wyświetlić dowolny tekst na wyświetlaczu HD44780."
      }
    ],
    "#n": 41
  },
  "## Plik. 42": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Zamieść niezbędne obliczenia.": "Konwerter analogowo-cyfrowy (ADC) służy do przetworzenia sygnału analogowego (np. napięcia) na sygnał cyfrowy. W celu dokonania pomiaru, sygnał analogowy jest próbkowany, czyli pobierane są próbki sygnału w określonych momentach czasowych. Następnie sygnał ten jest kwantowany, czyli sygnał analogowy jest zaokrąglany do najbliższej wartości z określonej skali. W przypadku kwantyzacji równomiernych, skala jest podzielona na równe przedziały o szerokości Δ:\n\nVquant = Δ * round (Vinput / Δ)\n\nGdzie:\nVinput – wartość sygnału wejściowego,\nΔ – szerokość przedziału kwantyzacji,\nVquant – wartość skwantowana sygnału.\n\nNastępnie wartości skwantowane są kodowane w formacie binarnym. Ilość bitów wykorzystywanych do kodowania wartości (rozmiar słowa) wpływa na dokładność pomiaru. Im większy rozmiar słowa, tym większa dokładność, ale również większe wymagania dla przetwarzania danych. \n\nKorzystając z konwertera ADC można w prosty sposób zbadać zmiany sygnału analogowego i przekształcić je na komputerową postać, co pozwala na ich dalsze przetwarzanie i analizę."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania konwertera analogowo-cyfrowego. Wyjaśnij jakie instrukcje są niezbędne do wykonania": "Konwerter analogowo-cyfrowy (ADC) jest urządzeniem elektronicznym, który przetwarza sygnał analogowy na sygnał cyfrowy. Sygnał analogowy jest w postaci ciągłej zmienności sygnału, natomiast sygnał cyfrowy jest w postaci ciągu impulsów. Konwerter analogowo-cyfrowy składa się z kilku bloków: wzmacniacza, komparatora, licznika oraz rejestru przesuwnego.\n\nWzmacniacz wzmacnia sygnał analogowy do odpowiedniego poziomu, aby móc go porównać z ustaloną wartością progową przez komparator. Komparator porównuje sygnał analogowy z wartością progową i generuje impuls cyfrowy o wartości 0 lub 1. Licznik zlicza pulsacje cyfrowe, aż do momentu, gdy generowany jest impuls wystarczająco silny, aby licznik zmienił swoją wartość. Ostatecznie, wartość zapisana w liczniku jest przesuwana do rejestru przesuwnego, z którego można ją odczytać w postaci kodu binarnego.\n\nAby wykonać konwersję analogowo-cyfrową, należy ustawić wartość napięcia wejściowego oraz dokładność konwersji. Następnie należy przekazać sygnał wejściowy do wzmacniacza i ustawić wartość progową w komparatorze. Po wykonaniu konwersji, wartość cyfrowa jest przenoszona do rejestru przesuwnego, aby umożliwić jego odczytanie."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie": "Nie zostały podane żadne wartości, więc nie można rozwiązać tego zadania, ale można przedstawić ogólną metodę rozwiązania:\n\n1. Określ układ współrzędnych, w którym będziesz opisywał ruch manipulatora (np. układ kartezjański czy biegunowy).\n2. Przyjmij jakieś wartości dla kąta obrotu łącza (np. 30 stopni) oraz prędkości obrotowej łącza (np. 2 obr./s).\n3. Korzystając z geometrii manipulatora oraz wartości kąta obrotu, oblicz położenie końca manipulatora (np. końcówki narzędzia) względem układu współrzędnych.\n4. Korzystając z kinematyki odwrotnej, oblicz wartości kątów w stawach pozwalające na osiągnięcie pożądanego położenia końca manipulatora.\n5. Przyjmij jakieś wartości dla przyspieszenia obrotowego łącza (np. 5 obr./s^2) oraz czasu trwania ruchu (np. 2 s).\n6. Korzystając z równań kinematycznych, oblicz wartości prędkości oraz przyspieszeń w stawach w trakcie ruchu.\n7. Sprawdź, czy wartości prędkości i przyspieszeń są zgodne z możliwościami mechanicznymi manipulatora (np. czy przyspieszenie nie przekracza dopuszczalnych wartości).\n8. Można przedstawić ruch manipulatora w postaci wykresów zależności kąta, prędkości i przyspieszenia od czasu."
      }
    ],
    "#n": 42
  },
  "## Plik. 43": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij sposób działania konwertera cyfrowo-analogowego. Zamieść niezbędne obliczenia.": "Konwerter cyfrowo-analogowy (DAC) to urządzenie, które przetwarza dane cyfrowe na sygnał analogowy, który może być wykorzystany do sterowania urządzeniami takimi jak głośniki, motory, pompy, itp. \n\nSposób działania konwertera cyfrowo-analogowego polega na przetwarzaniu wartości cyfrowych na wartości analogowej napięcia lub prądu. Najprostszy rodzaj DAC-a to konwerter typu trybuieńczego, w którym każdy bit sygnału cyfrowego jest konwertowany na oznaczoną wartość napięcia lub prądu. \n\nNa przykład, jeśli mamy 8-bitowy sygnał cyfrowy, który ma wartość 10101101 (w systemie dziesiętnym 173), każdy bit może być konwertowany na napięcie lub prąd odpowiadający 1/256 całkowitej wartości wyjściowej. Ostatecznie, w pełni skonwertowany sygnał wyjściowy będzie równy:\n\nVout = (1/256) * (1*1 + 0*2 + 1*4 + 0*8 + 1*16 + 1*32 + 0*64 + 1*128)\n\nVout = (1/256) * (173)\n\nVout = 0.676 V\n\nWartość napięcia lub prądu, którą można uzyskać jako wynik konwersji, może być kontrolowana przez użytkownika poprzez wybór odpowiedniego punktu odniesienia, który określa zakres wartości analogowych. Dla przykładu, jeśli chcemy uzyskać napięcie wyjściowe w zakresie 0-5 V, wtedy każdej wartości analogowej odpowiada 19,53 mV. \n\nKonwerter cyfrowo-analogowy może być również stosowany w wielu innych aplikacjach, np. sterowaniu silnikami, pilotowaniu wyświetlaczy LCD, konstrukcji układów chirurgicznych, wprowadzaniu zmian w sygnale dźwiękowym lub graficznym, itp."
      },
      {
        "Zad. 2 Układ jest przedstawiony jak na rysunku, gdzie R1= 50Ω to impedancja układu zasilania, a Rs= 300Ω to": "impedancja obciążenia. \n\n![UKŁAD](https://i.imgur.com/SgCOvls.png)\n\nAby obliczyć prąd I płynący przez obciążenie, musimy najpierw obliczyć napięcie V wyjściowe z układu.\n\nWykorzystując podział napięcia i zastępując impedancję szeregową R1 i Rs impedancją zastępczą, otrzymujemy:\n\nV = Vi * Rs / (R1 + Rs) = 10 * 300 / (50 + 300) = 8 V\n\nNastępnie, wykorzystując prawo Ohma, możemy obliczyć prąd płynący przez obciążenie:\n\nI = V / Rs = 8 / 300 = 0,0267 A = 26,7 mA\n\nOdpowiedź: Prąd płynący przez obciążenie wynosi 26,7 mA."
      },
      {
        "Zad. 3 Rozwiąż proste zadanie kinematyki dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na": "podstawie obrotowej.\n\nNie podano dokładnego sformułowania zadania, dlatego poniżej przedstawione zostaną ogólne zasady ruchu manipulatora złożonego z jednego łącza pryzmatycznego.\n\nManipulator złożony z jednego łącza pryzmatycznego umieszczony na podstawie obrotowej może osiągnąć różne położenia i orientacje w przestrzeni. Aby opisać jego ruch, stosuje się parametry opisujące położenie i orientację łącza.\n\nPołożenie łącza można opisać za pomocą współrzędnych kartezjańskich x, y, z, określających położenie końca łącza w przestrzeni. Orientacja łącza opisywana jest za pomocą tzw. kątów Eulera, które określają, jak łącze powinno być obrócone wokół trzech osi: x, y, z.\n\nDla manipulatora złożonego z jednego łącza pryzmatycznego istnieją dwa rodzaje ruchów: ruch translacyjny oraz ruch obrotowy.\n\nW ruchu translacyjnym łącze porusza się wzdłuż jednej z osi kartezjańskich, przy czym orientacja łącza pozostaje niezmieniona. Przykładowo, jeśli łącze przesuwa się wzdłuż osi x, to współrzędna x zmienia się, a pozostałe współrzędne i kąty Eulera pozostają stałe.\n\nW ruchu obrotowym łącze obraca się wokół jednej z osi, zmieniając jednocześnie swoją orientację. Przykładowo, jeśli łącze obraca się wokół osi x, to zmieni się wartość jednego z kątów Eulera, a pozostałe współrzędne i kąty pozostaną stałe.\n\nAby manipulator mógł poruszać się po określonym torze ruchu, należy zaplanować sekwencję ruchów. Można to zrobić za pomocą trzech metod: ruchu prostoliniowego, interpolacji linowej i interpolacji spline’ów.\n\nW ruchu prostoliniowym manipulator przesuwa się po linii prostej, łączącej początkową i końcową pozycję. W tym przypadku należy określić punkty startowy i końcowy oraz prędkość ruchu.\n\nInterpolacja linowa polega na interpolowaniu liniowo pomiędzy dwoma punktami ruchu, przy czym określa się prędkość manipulatora w punkcie początkowym i końcowym.\n\nInterpolacja spline’ów polega na interpolowaniu między punktami z użyciem krzywych spline’ów. W tym przypadku manipulator porusza się po krzywej, przy czym określa się kształt spline’ów oraz prędkość ruchu.\n\nWszystkie te metody pozwalają na zaplanowanie ruchu manipulatora złożonego z jednego łącza pryzmatycznego. Jednakże, w celu wykonania zadania, konieczne jest określenie celu ruchu oraz trajektorii, którą manipulator powinien przebyć, co zależy od konkretnego zadania."
      }
    ],
    "#n": 43
  },
  "## Plik. 44": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij zastosowanie Supervisor-a w oprogramowaniu Webots. Pokaż jak i jakie instrukcje służą do odczytywania": "i kontrolowania Supervisor-a w Webots.\n\nSupervisor w oprogramowaniu Webots jest głównym kontrolerem symulacji, który zarządza środowiskiem symulacji oraz interakcjami pomiędzy różnymi obiektami w symulacji. Supervisor umożliwia również komunikację z zewnętrznymi programami, dzięki czemu można zintegrować symulację z innymi systemami.\n\nInstrukcje do odczytywania i kontrolowania Supervisor-a w Webots zależą od języka programowania, w którym piszemy kod kontrolera. Przykładowo, w języku Python możemy użyć następujących instrukcji:\n\n1. Supervisor.getTime() - zwraca aktualny czas symulacji.\n2. Supervisor.setLabel(1, 'Hello world!') - umieszcza etykietę \"Hello world!\" na pierwszym obiekcie w symulacji.\n3. node = Supervisor.getFromDef('ROBOT') - pobiera obiekt o nazwie \"ROBOT\".\n4. node.getField('translation').setSFVec3f([1, 0, 0]) - ustawia wartość pola \"translation\" obiektu na [1, 0, 0].\n\nPowyższe instrukcje ilustrują kilka sposobów, w jakie można odczytywać i kontrolować Supervisor-a w Webots. Można użyć ich do tworzenia kontrolerów robotów, detekcji kolizji, zarządzania światłami i wiele innych zadań."
      },
      {
        "Zad. 2 Wyjaśnij sposób działania silnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną, oraz w trybie z pełnym": "krokiem i dwoma fazami aktywnymi.\n\nSilnika krokowego w trybie z pełnym krokiem i jedną fazą aktywną:\n\nW trybie z pełnym krokiem i jedną fazą aktywną, silnik krokowy działa na zasadzie przemieszczania się zatrzasków magnetycznych między dwoma cewkami. Jeden obieg silnika składa się z czterech kroków, co oznacza, że przy każdym kroku następuje obrót wału silnika o kąt 90 stopni.\n\nFaza aktywna wskazuje na to, którą z cewek należy w danym momencie zasilić. W przypadku trybu z pełnym krokiem i jedną fazą aktywną, zasila się jedną z cewek, a drugą pozostawia się bez zasilania.\n\nPierwszy krok: Zasilenie pierwszej cewki powoduje obrót wału silnika o 90 stopni w kierunku zgodnym z ruchem wskazówek zegara.\n\nDrugi krok: Odłączenie zasilania z pierwszej cewki, a następnie zasilenie drugiej cewki, powoduje obrót wału silnika o kolejne 90 stopni.\n\nTrzeci krok: Odłączenie zasilania z drugiej cewki, a następnie zasilenie pierwszej cewki z przeciwną polaryzacją, powoduje obrót wału silnika o kolejne 90 stopni.\n\nCzwarty krok: Odłączenie zasilania z pierwszej cewki z przeciwną polaryzacją, a następnie zasilenie drugiej cewki z przeciwną polaryzacją, powoduje obrót wału silnika o kolejne 90 stopni.\n\nSilnika krokowego w trybie z pełnym krokiem i dwoma fazami aktywnymi:\n\nW trybie z pełnym krokiem i dwoma fazami aktywnymi, każdy obieg silnika składa się z ośmiu kroków, co oznacza, że przy każdym kroku następuje obrót wału o kąt 45 stopni.\n\nW przypadku trybu z pełnym krokiem i dwoma fazami aktywnymi, zasilane są dwie cewki na przemian, co powoduje zwiększenie kąta obrotu przy każdym kroku.\n\nPodczas pracy silnika w trybie z pełnym krokiem i dwoma fazami aktywnymi, krok kolejny jest realizowany przez zasilanie kolejnych cewek w cyklu AB-BC-CD-DA.\n\nPierwszy krok: Zasilenie cewki A powoduje obrót wału silnika o 45 stopni w kierunku zgodnym z ruchem wskazówek zegara.\n\nDrugi krok: Zasilenie cewki B powoduje obrót wału silnika o kolejne 45 stopni.\n\nTrzeci krok: Zasilenie cewki C powoduje obrót wału silnika o kolejne 45 stopni.\n\nCzwarty krok: Zasilenie cewki D powoduje obrót wału silnika o kolejne 45 stopni.\n\nKolejne kroki są realizowane przez ciągłe zasilanie dwóch kolejnych cewek w cyklu AB-BC-CD-DA."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza obrotowego zamontowanego na bazie i połą-": "czonego z jednym przegubem obrotowym w końcu.\n\nParametry DH dla manipulatora:\n\n1. Tworzenie osi z\n\n- z1 - obrót wokół osi z, punkt A do punktu B, prostokątny do osi x\n- z2 - obrót wokół osi z, punkt B do punktu C, prostokątny do osi x\n\n2. Tworzenie osi x\n\n- x0 - punkt C do D, prostokątny do płaszczyzny xy\n- x1 - punkt B do punktu C, nachylony o kąt 90° w kierunku osi z\n- x2 - punkt A do punktu B, prostokątny do osi z\n\n3. Długości ogniw\n\n- d1 - odległość między osią z1 a z2\n- a1 - odległość między osią x0 a x1\n- a2 - odległość między osią x1 a x2\n\n4. Kąty przegubów\n\n- θ1 - obrót wokół osi z1\n- θ2 - obrót wokół osi z2\n\nParametry DH:\n- d1 = 0\n- a1 = 0\n- a2 = l1\n- θ1 = 0\n- θ2 = θ\n\nGdzie l1 to długość łącza, a θ to kąt obrotu drugiego przegubu."
      }
    ],
    "#n": 44
  },
  "## Plik. 45": {
    "q&a": [
      {
        "Zad. 1 Wyjaśnij pojęcie przekształceń jednorodnych.": "Przekształcenia jednorodne to takie przekształcenia geometryczne, które zachowują proporcjonalne relacje między wielkościami. Innymi słowy, jeśli dana figura zostanie przemnożona przez pewną stałą, to wszystkie jej wymiary zostaną pomnożone przez tę samą stałą. Przykładowo, gdy mamy trójkąt o podstawie 3 cm i wysokości 4 cm, przemnożenie go przez 2 da nam trójkąt o podstawie 6 cm i wysokości 8 cm. Przekształcenia jednorodne są przydatne w matematyce, fizyce i innych naukach, gdzie stosuje się je do opisu skali i proporcji wielkości w różnych kontekstach."
      },
      {
        "Zad. 2 Wyjaśnij zjawiska zachodzące w złączu P-N.": "Złącze P-N jest złączem pomiędzy dwoma półprzewodnikami o różnych typach przewodnictwa: z jednej strony półprzewodnikiem typu P (zdominowanym przez domieszkę akceptorową), a z drugiej strony półprzewodnikiem typu N (z domieszką donorową). \n\nPodczas łączenia tych dwóch półprzewodników dochodzi do migracji nośników ładunku z jednego do drugiego materiału. Elektrony z półprzewodnika N migrują do półprzewodnika P, gdzie reagują z wolnymi \"dziurami\" (brakującymi elektronami) uwięzionanymi w domieszce akceptorowej. W wyniku reakcji elektronów i dziur powstają powiązania kowalencyjne między atomami półprzewodnika, co skutkuje utworzeniem obszaru o zubożonej domieszce (region zaporowy).\n\nRegion ten powoduje, że złącze P-N staje się diodą półprzewodnikową. Podczas przepływu prądu przez diodę, elektrony przepływają z obszaru N do P, a dziury z obszaru P do N, ale nie mogą one przeskoczyć na przeciwną stronę, ponieważ napotykają barierę w postaci zubożonej strefy. W ten sposób złącze P-N przewodzi prąd tylko w jednym kierunku, a w drugim pełni funkcję izolatora. \n\nPod wpływem polaryzacji zewnętrznej, np. przy podłączeniu zewnętrznej baterii, w obszarze P (polaryzacja dodatnia) elektrony zdominowane przez większą ilość \"dziur\" zaczynają przesuwać się ku złączu. Jednocześnie w obszarze N (polaryzacja ujemna) elektrony zaczynają przesuwać ku złączu i reagują z dziurami w domieszce akceptorowej. W wyniku tych procesów zęby zwiększa się szerokość zubożonej strefy, a w konsekwencji zwiększa się opór diody. \n\nZjawiska zachodzące w złączu P-N mają wiele zastosowań w elektronice i są podstawą funkcjonowania wielu elementów, takich jak diody, tranzystory czy fotodiody."
      },
      {
        "Zad. 3 Wyznacz parametry DH dla manipulatora złożonego z jednego łącza pryzmatycznego zamontowanego na bazie i": "ze stawem obrotowym na końcu łącza.\n\nParametry DH definiują zależności geometryczne i kinematyczne pomiędzy kolejnymi ogniskami manipulatora. Aby wyznaczyć parametry DH dla takiego manipulatora, należy:\n\n1. Zdefiniować układ odniesienia: Na rysunku poniżej zaznaczono układ odniesienia, w którym rozważany będzie manipulator. Układ ten ma jednostkowe wektory wzdłuż osi x, y i z, które odpowiadają kolejno kierunkowi bazy, pierwszemu łączu i końcowemu stawowi obrotowemu. Wyznaczamy również środek masy i długość łącza pryzmatycznego.\n\n![manipulator_prismatyczny.png](https://drive.google.com/uc?id=1yCvK4L4JQXxpIwnx0WZJ828HYRykchYC)\n\n2. Podzielić manipulator na segmenty:\nW tym przypadku manipulator składa się tylko z jednego segmentu - łącza pryzmatycznego.\n\n3. Dla każdego segmentu zdefiniować parametry DH:  \n\nW przypadku łącza pryzmatycznego, zdefiniujemy jedną parę parametrów DH:\n\n- $\\theta_i$ - kąt między osią $Z_i$ a osią $Z_{i-1}$ - w tym przypadku $\\theta_1 = 0$ ze względu na położenie bazy\n- $d_i$ - odległość między osią $Z_{i-1}$ a osią $Z_i$ - tutaj $d_1$ będzie równe długości łącza pryzmatycznego\n- $a_i$ - odległość między osią $X_{i-1}$ a osią $X_i$ - w tym przypadku $a_1 = 0$ ponieważ osie $X_0$ i $X_1$ nachodzą na siebie\n- $\\alpha_i$ - kąt między osią $X_{i-1}$ a osią $X_i$ - tutaj $\\alpha_1 = \\pi/2$ ponieważ oś $X_1$ jest prostopadła do osi $Z_0$ i kieruje się w stronę osi $X_0$\n\nOstatecznie, parametry DH dla manipulatora składającego się z jednego łącza pryzmatycznego wyglądają następująco:\n$\\theta_1 = 0$\n$d_1 = l$\n$a_1 = 0$\n$\\alpha_1 = \\pi/2$,\n\ngdzie $l$ to długość łącza pryzmatycznego."
      }
    ],
    "#n": 45
  }
}
